{"source": "steam_news_api", "gid": "1819386365083889", "title": "Diablo IV | Season of Divine Intervention | Season 11 Now Live!", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1819386365083889", "date_utc": "2025-12-16T23:16:59+00:00", "contents": "[p][/p][previewyoutube=\"qvkD6xHuuqo;full\"][/previewyoutube][p]“Darkness gathers. But fear not, Wanderer. A new day is coming. And you will be the dawn.” - Hadriel [/p][p][/p][p]Beat back the Lesser Evils with the power of the Divine Gifts. Partake in evolved monster combat, a reworked item journey, and more in the Season of Divine Intervention. [/p][p][/p][p]Now Live! Prepare yourself: [url=\"https://blizz.ly/3KybnQ4\"]https://blizz.ly/3KybnQ4[/url][/p]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "1811138915560849", "title": "Diablo IV | Season of Infernal Chaos | Season 10 Now Live!", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1811138915560849", "date_utc": "2025-09-23T17:00:25+00:00", "contents": "[p][/p][previewyoutube=\"kDc2ue8cAJo;full\"][/previewyoutube][p]Hunt for Chaos Armor with max power and rare affixes. Unleash Chaos Perks to redefine your build. Face the reworked Infernal Hordes and dive into Chaos Rifts for elite loot and XP. [/p][p]Season of Infernal Chaos arrives in [url=\"https://www.youtube.com/hashtag/diabloiv\"]#DiabloIV[/url] September 23. [/p][p]Details await: [url=\"http://blizz.ly/4nzqwOZ\"]http://blizz.ly/4nzqwOZ[/url][/p][p][/p]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "1803527891677000", "title": "Diablo IV | Sins of the Horadrim | Season 9 Now Live!", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1803527891677000", "date_utc": "2025-07-01T17:00:26+00:00", "contents": "[p][/p][previewyoutube=\"6W5UkhQVtMQ;full\"][/previewyoutube][p][/p][p]Some secrets are too dark to be contained 💀 [/p][p][/p][p]⚡ Customizable Spells [/p][p]💀 Deadly Strongrooms [/p][p]⚔️ New Loot and Rewards [/p][p]😈 And so much more… [/p][p][/p][p]Uncover hidden revelations when Sins of the Horadrim arrives in [url=\"https://www.youtube.com/hashtag/diabloiv\"]#DiabloIV[/url] on July 1.[/p]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "1788311419184409", "title": "Master the Occult in Season of Witchcraft (part 1 of 2)", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1788311419184409", "date_utc": "2025-01-14T18:39:35+00:00", "contents": "The Tree of Whispers’ most prized possessions are missing: the many Heads which pay their endless debt amongst its gnarled limbs. Uncover the source of this malevolent plot to discover incredible power. Starting on [b]January 21, at 10 a.m. PST[/b], embark on a new Seasonal Questline to unlock powers of Witchcraft, slay the rogue Headrotten, and uncover the secrets behind this haunting mystery. [img]{STEAM_CLAN_IMAGE}/44681402/70edb5372125c16fca8873c0f9a84f1091790c45.jpg[/img] Witchcraft Powers will be your gateway to wonderful new abilities, augmenting and empowering your existing skills. You’ll earn them as you uncover the mystery of the Coven, a group of heady Witches deep from within the bogs of Hawezar who are eager to serve the Tree of Whispers. As you ally with the Tree of Whispers, you’ll progress and enhance these wild powers throughout Season of Witchcraft. This update also brings changes to all realms with the Armory, which lets you swap between your favorite builds with ease. Vessel of Hatred owners can search out and wield both new and updated Runes. Plus, there’s new Uniques and Legendary Aspects to earn and master, an all-new Pet in the Season Journey, and more. Thank you to everyone who participated in December’s 2.1 Public Test Realm. We want you all to know that we’ve integrated feedback throughout this blog, but some feedback that was given will be used to help shape and inform future seasons. [previewyoutube=R4Kc7LjVwa8;full][/previewyoutube] [h2]Ally with the Coven[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/69b0dc15f7b47919ccb3ecfe4a385ffe74bc11db.jpg[/img] Heed the call of the Witches of Hawezar, a Coven that is bound by the deep magic oozing from the swamps they call home. The Coven are the protectors of the Tree of Whispers, who discovered its many captive Heads are missing. The Tree forgets no oaths and forgives no debts, and these Heads have dues to pay till the end of days. However, these missing Heads have been set loose—free to carry out their own hunt—travelling across Sanctuary to seek bodies and reclaim what was once theirs. [img]{STEAM_CLAN_IMAGE}/44681402/abbaf87a3c86575f81279b203000593266f27182.jpg[/img] Summoned by the Witches of Hawezar, unravel the mystery of the missing Heads and expose the culprit in an all-new Questline. Within the Questline, you’ll uncover the tantalizing secrets to learn and harness seasonal Witchcraft Powers. [img]{STEAM_CLAN_IMAGE}/44681402/b38e33cb8f970a70fa6d9054f2e0aa84170cebb7.jpg[/img] Help them to return the Heads to the Tree, and solve the mystery of who is stealing the Heads and why, and the Coven will reward you with the secrets of their awesome incantations. To begin the questline, head to Gea Kul and speak with the Witch Gelena. [h2]Master Powers of Witchcraft[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/4e11cc307fc3f22179bf7dad820adccf7f14a0a8.jpg[/img] A strange sorcery has risen from the crags and bogs of Sanctuary—a sparkle is in the air and the ground thrums with the presence of dark magic. Embark on the Seasonal Questline, unlock the wondrous powers of Witchcraft, and unleash these newfound horrors to melt the bones of the unwilling. There are three schools to learn and master: [list] [*]Eldritch—Wield magic that harnesses destructive energies.[/*] [*]Psyche—Wield defensive powers of the mind and spirit to create visions, focus your attacks, and induce madness in your enemies.[/*] [*]Growth & Decay—Wield living magic that both heals and harms, boosting Life, Resource. These incantations can create horrific diseases and disruptions.[/*][/list] [img]{STEAM_CLAN_IMAGE}/44681402/c8ae3332380eae96c8865f0919b6739c0f9171db.jpg[/img] Plus, discover rare Lost powers of Witchcraft unkown to both the Coven and the Tree. Each school of Witchcraft gives you the chance to experiment between new styles of power. Tinker with your build to create something strange and terrible to dismember your many formidable foes. [img]{STEAM_CLAN_IMAGE}/44681402/4b92ee651e994107fa448f898b1f0052c2f1c78f.jpg[/img] To learn Witchcraft, earn Seasonal reputation with the Coven from completing new Whisper bounties and defeating hulking Headrotten enemies to earn Restless Rot. At specific Tiers, you’ll unlock the ability to learn more Witchcraft Powers at Witches’ Altars near the Tree of Whispers. [img]{STEAM_CLAN_IMAGE}/44681402/c18203ff51f3076ca619c5165acf5402c2c18c8d.jpg[/img] To earn your Witchcraft Powers, do as the Witches ask by hunting down the Headrotten and returning the Heads where they belong to earn Restless Rot. This will grant you favor amongst The Coven. [img]{STEAM_CLAN_IMAGE}/44681402/76d2ade49588b62f3168c96cec0b78ef247ff946.jpg[/img] Once you’ve earned favor with the Coven, upgrade the Altars underneath the Tree of Whispers to unlock new Witchcraft Powers. To unlock Lost powers, you’ll need a Forgotten Altar. Forgotten Altars are elusive, so keep an eye out for them within random dungeons throughout Sanctuary. [img]{STEAM_CLAN_IMAGE}/44681402/2f5158bf378a90314a702b3514baa2a8cdc1c419.jpg[/img] Witchcraft Powers can be upgraded directly in your inventory using the Restless Rot you’ve earned. Slaying Headrotten in higher difficulty tiers will earn you more Restless Rot. [img]{STEAM_CLAN_IMAGE}/44681402/650d89473a53af78289274ca080d3c87b36be0c7.jpg[/img] [h3]Eldritch Powers[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/2e26430a3099bea307c9e576071e871b421aad2e.jpg[/img] [b]Firebat Servants[/b] [list] [*]A deadly swarm of Firebats swarm enemies every [u]3[/u] seconds, inflicting [u]20%[/u] total Fire damage over 1 total attack.[/*] [*]At Higher Ranks: Enemies are Stunned for 3 seconds after being hit 5 times by your Firebat Servants.[/*][/list] [b]Abyssal Resonance[/b] [list] [*]Every 250 Resource spent, release an explosion dealing [u]400%[/u] Shadow damage. Each explosion triggered within 10 seconds of the last increases the size and damage by 130%. Stacking up to 3 times.[/*] [*]At Rank 10: The third explosion pulls enemies towards you before detonating.[/*][/list] [b]Wave of Woe[/b] [list] [*]Release a Wave of Woe when damaging an enemy with your skills. Wave of Woe deals an additional X Shadow damage and echoes this damage to all other nearby enemies of the same type.[/*] [*]At Rank 5: Damage is increased by 15% each time damage is echoed and is guaranteed to echo at least 5 times. May strike the same target multiple times.[/*][/list] [b]Purging Touch[/b] [list] [*]Eldritch Effects X increased damage against Headrotten.[/*] [*]At Rank 10: This damage bonus now extends to all monsters.[/*][/list] [b]Shaken Soul[/b] [list] [*]Eldritch Effects apply Vulnerable to enemies for X seconds.[/*] [*]At Rank 10: Damage from Psyche and Growth & Decay Effects will also apply Vulnerable at half the duration.[/*][/list] [b]Hex of Flames[/b] [list] [*]Lucky Hit: You have up to an X chance to apply Hex of Flames. Hex of Flames deals [u]40%[/u] additional Fire damage each time you deal damage to the target.[/*] [*]At Rank 7: Hex of Flames explodes dealing damage to all nearby enemies when you land a Critical Strike.[/*][/list] [b]Doom Orb[/b] [list] [*]An ominous orb of pure Eldritch energy circles you, damaging any enemy it touches for [u]400%[/u] Fire damage. Doom Orb may launch itself at distant enemies before returning.[/*] [*]At Rank 5: Kills or damage to Bosses empower the orb’s damage by 5%. After 100%, the orb explodes dealing 5,200 damage to nearby enemies before reforming 3 seconds later.[/*][/list][h3]Psyche Powers[/h3] [b]Life Link[/b] [list] [*]Automatically link your life force with up to 3 nearby enemies. X of the damage you take is shared with the linked targets as physical damage. Cannot Life Link to enemy Players.[/*] [*]At Rank 15: For 10 seconds after using a Defensive, Macabre of Subterfuge Skill, any linked damage will be a guaranteed Critical Strike.[/*][/list] [b]Hex of Shattering[/b] [list] [*]Damage done by your Witchcraft Effects afflicts enemies with Hex of Shattering causing them to deal X reduced damage for 5 seconds.[/*] [*]At Rank 8: When any Hex Effect is applied to Headrotten, all damage will be guaranteed Critical Strikes for 5 seconds.[/*][/list] [b]Aura of Misfortune[/b] [list] [*]Enemies near you have X chance for their attacks to be interrupted. Does not work on bosses.[/*] [*]At Rank 5: Aura of Misfortune increases your Movement Speed by 5% and Slows enemies by 30%.[/*][/list] [b]Aura of Lament[/b] [list] [*]When you first strike an enemy, it is afflicted with an Aura of Lament that Slows it and other nearby enemies by 70%. For each enemy inside Aura of Lament, you gain [u]3[/u] Primary Resource each second. If the initial enemy dies, Aura of Lament is passed onto another nearby enemy retaining the duration. Lasts X seconds.[/*] [*]Only 1 enemy may be afflicted at a time. May only occur every 30 seconds.[/*][/list] [b]Vengeful Spirit[/b] [img]{STEAM_CLAN_IMAGE}/44681402/256c9be2e8baf49c9544ffb41c621cf5a162c901.jpg[/img] [list] [*]Every 19 Seconds, a Vengeful Spirit Servant appears for X seconds. While active, all damage taken is instead taken by the spirit. Vengeful Spirit Servant deals [u]750%[/u] damage.[/*] [*]At Rank 5: When the Vengeful Spirit’s Life is fully depleted, it rushes towards up to 8 enemies dealing 2,000 Shadow damage.[/*][/list] [b]Twilight Warding[/b] [list] [*]Every X seconds, gain a Barrier for 5 seconds absorbing 100 damage.[/*] [*]At Rank 12: Twilight Warding reflects enemy projectiles while active.[/*][/list][h3]Growth & Decay Powers[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/946ef68975e120747ed35b215a3a455ce6caf760.jpg[/img] [b]Poison Frog Servant[/b] [list] [*]Summon a Poison Frog Servant that attacks and Poisons enemies for [u]150%[/u] damage over 3 seconds. On death, the frog explodes violently dealing X Poison instantly damage to nearby enemies. This explosion will always Critically Strike.[/*] [*]At Rank 5: Poison Frog attacks will pull enemies towards itself and Taunt enemies for 1 second.[/*][/list] [b]Soul Harvest[/b] [list] [*]Feed upon the life force of nearby enemies whenever you use a skill with a cooldown, increasing your primary stat by 3% per monster for X seconds.[/*] [*]At Rank 9: Soul Harvest does not lose duration so long as enemies are nearby.[/*][/list] [b]Hex of Whispers[/b] [list] [*]Dealing damage to an enemy afflicts them with Hex of Whispers that deals X Shadow damage the next time damage is dealt. Afterwards, Hex of Whispers will jump to another enemy up to a maximum of 6 times. Hex of Whispers may only be applied once every 5 seconds.[/*] [*]At Rank 7: After bouncing onto 6 enemies, the hex bounces back to you granting [u]15%[/u] Fortify and removing all crowd control and negative status effects.[/*][/list] [b]Decay Augmentation[/b] [list] [*]Your Witchcraft Effects deal X of the damage dealt over 5 seconds. The damage type is based on your class.[/*] [*]At Rank 10: When your damage-over-time effects exceed 85% of the target’s total Life, they immediately die.[/*][/list] [b]Grow[/b] [list] [*]After casting an Ultimate Skill, your Servants, Minions, and Companions are empowered with dark magics. Growing larger in size and dealing X bonus damage. Lasts 15 seconds.[/*] [*]At Rank 11: Your Servants, Minions and Companions gain 100% Critical Strike Chance while enlarged.[/*][/list] [b]Aura of Siphoning[/b] [list] [*]Conjure an aura of decay that deals [u]80%[/u] Poison damage to enemies every second.[/*] [*]At Rank 10: Each time Aura of Siphoning deals damage, you are healed for 1% of Maximum Life.[/*][/list] [b]The Cycle[/b] [list] [*]Dealing any damage with your skills has a 15% chance to grow a flower from the ground. When an enemy is near, the flower deals X Poison damage to that enemy over 5 seconds. If an ally is near, the flower Heals for 6% Maximum Life. The flower withers away after use. A flower may grow once every [u]2[/u] seconds per enemy.[/*] [*]At Rank 5: The damage and healing affects all enemies or allies near the flower.[/*][/list] [img]{STEAM_CLAN_IMAGE}/44681402/b10482ebf8093a61ebb1739fce77c85f48e4ba74.jpg[/img] [h3]Lost Powers[/h3] [b]Breath of the Coven[/b] [list] [*]Dealing damage or applying a Crowd Control effect with any of your Witchcraft Effects increases your Attack Speed by X for 10 Seconds, stacking once per unique Witchcraft Effect.[/*] [*]Witchcraft Effects are Eldritch, Psyche, and Growth & Decay.[/*] [*]At Rank 8: Gain 40% Lucky Hit chance while bonuses from Eldritch, Psyche, Growth & Decay are active at once.[/*][/list] [b]Hex Specialization[/b] [list] [*]Increase the potency of your Hex Effects by X.[/*] [*]At Rank 10: Increase the Critical Strike Chance by 10% against enemies afflicted by your Hex Effects.[/*][/list] [b]Aura Specialization[/b] [list] [*]The size of your Aura Effects are increased by X.[/*] [*]At Rank 10: Increase the Critical Strike Damage by 50% against enemies inside your Aura Effects.[/*][/list] [b]Piranhado[/b] [list] [*]When an enemy is afflicted by both a Hex and an Aura Effect, a Piranhado is summoned pulling enemies towards it and dealing X Physical damage over 12 seconds. May occur once every 20 seconds.[/*] [*]At Rank 5: Piranhado moves itself towards nearby enemies.[/*][/list][h2]The Tree of Whispers Grows[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/ebb441047c4d3ef51c6acf8c624b1dd69c9af196.jpg[/img] Since the Heads once dotting the macabre canopy have disappeared, The Tree of Whispers has invigorated their bounties with a renewed fervor. Set out to track down these rogue Heads and bring this chaos to heel. [img]{STEAM_CLAN_IMAGE}/44681402/8bc2fb575d548b129ddd5d9e0e36e610225c10d3.jpg[/img] There are many new Whisper bounties to seek out and complete to appease the enraged tree. During Season of Witchcraft, there’s a chance the Tree will offer an Ancestral Collection as your reward, guaranteeing at least 1 Ancestral item within. [img]{STEAM_CLAN_IMAGE}/44681402/5e67ed69dd1211acaedd0aa7d2f1edf0a51f295f.jpg[/img] [h2]Hunt the Headrotten[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/e7ae67594c21c72c96a1d1603279fe6249a5fdd3.jpg[/img] The Heads missing from the Tree of Whispers have become even more ghastly, true abominations. They are desperate to claim new bodies for themselves, to be whole and human again. But without the Tree they are incomplete, fragmented and mad. They spread a terrible rot to anyone they touch. [img]{STEAM_CLAN_IMAGE}/44681402/e286769434c8252f5a13fe54ede38b0885b38f1a.jpg[/img] Multiple Headhunt zones will appear across Sanctuary which signal that vicious Headrotten are skulking the zone, eager to carry out their disembodied Heads’ command. These Headhunt zones are perfect for completing Whisper bounties. During Season of Witchcraft, you’ll be able to return your Whispers at a new additional location: the Raven of the Tree, a friendly Raven found within Headhunts. [img]{STEAM_CLAN_IMAGE}/44681402/8e50b5a623f8b35d66d559074a966139d122c502.jpg[/img] Completing Whisper bounties within a Headhunt zone will reveal Exposed Roots, and gives a rare chance to spawn an Uprooted Cocoon. Uprooted Cocoons will spawn the elusive and deadly Headrotten Bosses. These Headrotten Bosses will appear often as Headless Husks, headless creatures that have lost their controlling Fugitive Head. [img]{STEAM_CLAN_IMAGE}/44681402/48fc1b7c4e730040856c9ab23098bee37fe07229.jpg[/img] In rare cases, this Headrotten Boss will appear with the Fugitive Head still attached. Killing one of these abominations will grant you a Head to return to the Coven, to their wicked delight and grand reward. [img]{STEAM_CLAN_IMAGE}/44681402/2390d68108ad69fa0800369a9fab9a23693f2a34.jpg[/img] Complete Whisper bounties within Headhunts to earn Favor with the Coven, and progress through the Coven’s Tiers to earn rewards such as a Resplendent Spark. You’ll also earn the Materials needed to craft Occult Gems, which provide disturbingly powerful enhancements to your Witchcraft Powers. [img]{STEAM_CLAN_IMAGE}/44681402/ecb53a6b602b5f4331323424e84b424510732a6f.jpg[/img] [h3]Rootholds[/h3] While completing Whisper bounties within Headhunts, keep a keen eye for any Rootholds. These seasonal dungeons have bonus challenges and rewards to aid your quest to support the Coven. To access, collect Whisper Wood sigils found in Whisper Caches and Silent Chests. [h2]Craft Powerful Occult Gems[/h2] These powerful Seasonal socketables are crafted with materials earned from completing Whisper bounties and returning Fugitive Heads from Headhunts. Meet with Gelena at the Tree of Whispers, who crafts Occult Gems in exchange for Fugitive Heads, Restless Rot, and Gem Fragments. If you manage to slay a Headrotten possessed by a Fugitive Head, you’ll be able to trade this reclaimed Head for Materials needed to craft Occult Gems. These powerful Gems provide additional affixes, strongly complement Witchcraft Powers, add Witchcraft tags to your Skills, and more. It is rumored Occult Gems had once even been used to cheat death, if you believe the legend. You can craft powerful higher tiers of Occult Gems with the following Materials: Fugitive Heads, Restless Rot, Gem Dust, and other Occult Gems. Each Occult Gem provides 160 Armor and 8% Resist All. Craft the following Occult Gems at Gelena: Wicked Pact [list] [*]Your Non-Unique Eldritch Witch Powers gain 25% Potency.[/*][/list] Heart of Anima [list] [*]Your Non-Unique Psyche Witch Powers gain 25% Potency.[/*][/list] Toadling's Wish [list] [*]Your Non-Unique Growth & Decay witch Powers gain [u]35%[/u] Potency.[/*][/list] Phantom String [list] [*]You deal [u]15%[/u] more Overpower damage to Hexed enemies.[/*][/list] Elder Sigil [list] [*]Your Agility, Corpse, Incarnate, Mastery, Weapon Master, and Wrath Skills deal 25% increased direct damage to Hexed enemies. [u]This Skill now has a Potency skill tag instead of Potency.[/u][/*][/list] Killing Wind [list] [*]While you have three or more Eldritch Witch Powers slotted, gain 25% Movement Speed and 15% Critical Strike Chance.[/*][/list] Witching Hour [list] [*]While you have three or more Eldritch Witch Powers slotted, every [u]1[/u] seconds, the next Core Skill you cast gains the Eldritch tag.[/*][/list] Raging Enigma [list] [*]Your Unique Witchcraft Powers deal 40% more damage.[/*][/list] Voice of the Stars [list] [*]While you have an Aura active, your Ultimate Skills gain each Grimoire tag and deal 10% more damage.[/*][/list] Mind Wreath [list] [*]While you have three or more Psyche Witch Powers slotted, your Defensive, Macabre, Trap Skills gain 20% Cooldown Reduction.[/*][/list] Spiral Coin [list] [*]While you have three or more Psyche Witch Powers slotted, gain 30% Control Duration and 20% Lucky Hit Chance.[/*][/list] Cornucopia [list] [*]While you have three or more Growth % Decay Witch Powers slotted, you generate 30% more Barrier, gain 30% more Fortify and have 30% more Thorns.[/*][/list] Vulture Talon [list] [*]While you have an Aura active, you deal Damage Over Time [u]50%[/u] faster.[/*][/list] Pointed Finger [list] [*]Your Summons deals [u]15%[/u] more direct damage to Hexed Elites.[/*][/list] Vile Phylactery [list] [*]While you have a Witch Power with the Summon tag slotted, if you would take fatal damage, instead prevent that damage. Then gain a Barrier equal to 100% of your Maximum Life and disable your Witchcraft Powers with the Summon tag for 6 seconds. This can only occur once every 75 seconds.[/*][/list] Friend of the Bog [list] [*]While you have three or more Growth & Decay Witch Powers slotted, you gain 10% primary stat, 10% Maximum Life and you are always Unhindered.[/*][/list] Moonlight Ward [list] [*]For each rank in your slotted Unique Witchcraft Power, you gain 3% Damage Reduction and [u]0.5%[/u] Maximum Resistance to All Elements.[/*][/list] Dust Stone [list] [*]For each of your Auras and Hexes an enemy is afflicted by, they take [u]2.5%[/u] increased damage from you.[/*][/list] Hungering Void [list] [*]While you have an Aura active, pull Nearby enemies toward you every 8 seconds.[/*][/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "1788311419184408", "title": "Master the Occult in Season of Witchcraft (part 2 of 2)", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1788311419184408", "date_utc": "2025-01-14T18:38:54+00:00", "contents": "[h2]New Legendary Aspects and Unique Items[/h2] New powerful Unique Items and Legendary aspects arrive to enhance your renowned demon crushing prowess. [h3]Barbarian[/h3] [b]Mantle of the Mountain’s Fury Unique Chest Armor[/b] Affixes [list] [*]Inherent: [u]100%[/u] Hammer of the Ancients damage for 5 seconds after an Earthquake explodes[/*] [*]251-444 Armor[/*] [*]3-6 Skill Ranks to Hammer of the Ancients[/*] [*]2-4 Skill Ranks of Defensive Stance[/*] [*]16-22.5% Chance for Earthquake to Deal Double Damage[/*][/list] Power [list] [*]Hammer of the Ancients also forms a seismic line that deals its damage and Slows enemies hit by 60-80% for 4 seconds. Earthquakes it passes through explode for their total damage and are consumed.[/*][/list] [b]Of Incendiary Fissures Legendary Aspect[/b] [list] [*]Your Earthquakes deal [u]40-60%[/u] increased damage and their damage is converted into Fire.[/*][/list][h3]Druid[/h3] [b]Malefic Crescent Unique Amulet[/b] Affixes [list] [*]Inherent: 25% Resistance to All Elements[/*] [*]8-11% Willpower[/*] [*]155-200% Werewolf Critical Strike Damage[/*] [*]8-15% Movement Speed while Shapeshifting into a Werewolf[/*] [*]1-2 Ranks of Feral Aptitude[/*][/list] Power [list] [*]The value of your Lupine Ferocity's consecutive Critical Strike Damage is increased to [u]150-200%[/u] against enemies when consecutively Critical Striking.[/*][/list] [b]Of Wolf’s Rain Legendary Aspect[/b] [list] [*]Casting Hurricane also spawns a smaller hurricane on your Wolves for 8 seconds. These hurricanes deals 5-15% of Hurricane’s damage for each active Wolf.[/*][/list] [b]Of Electrified Claws Legendary Aspect[/b] [list] [*]Shapeshifting into a new animal form causes a Lightning Bolt to strike a Nearby enemy dealing Lightning damage. Your Lightning Bolts deal 20-40% increased damage and Stun for 2 seconds.[/*][/list][h3]Necromancer[/h3] [b]Indira's Memory Unique Pants[/b] Affixes [list] [*]Inherent: Casting Bone Spear Reduces Blood Wave's Cooldown by 2 Seconds[/*] [*]16-25% Maximum Life[/*] [*]82.5-115% Overpower Damage[/*] [*]18.5-30% Damage Reduction While Injured[/*] [*]2-3 Ranks of Tides of Blood[/*][/list] Power [list] [*]Blood Wave is also a Bone Skill that spawns a Bone Prison at its end point and increases your Blood Skill damage by 40-80% for 8 seconds when cast.[/*] [*]Bone Spear is also a Blood Skill and will drain 10% Maximum Life each cast after hitting an enemy to consume a surrounding Corpse and launch one new Bone Spear from it.[/*][/list] [b]Kessime's Legacy Unique Pants[/b] Affixes [list] [*]Inherent: Casting Blood Wave Fortifies You For 70% of Your Maximum Life[/*] [*]187-300% Ultimate Damage[/*] [*]9.5-2% Damage Reduction While Fortified[/*] [*]16-25% Blood Wave Cooldown Reduction[/*] [*][u]23.5-35%[/u] Chance for Blood Wave to Deal Double Damage[/*][/list] Power [list] [*]Blood Wave now forms a wave on each side of you. Both waves converge at your feet, Pulling In surrounding enemies and exploding for x damage.[/*] [*]Each time an enemy is hit by a wave, they take 5-10% increased damage from your Blood Waves, up to 150-300% in total.[/*][/list] [b]Of Distilled Anima Legendary Aspect[/b] [list] [*]While Soulrift is active, you are Unhindered and gain 1% increased Movement Speed per absorbed soul, up to 30-60%. This lasts for 5 seconds after Soulrift ends.[/*][/list] [b]Bone Duster's Legendary Aspect[/b] [list] [*][u]Bone Spear is guaranteed to Overpower enemies within Bone Prison and deals 30-50% increased damage to them.[/u] [/*][/list][h3]Rogue[/h3] [b]Assassin’s Stride Unique Boots[/b] Affixes [list] [*]Inherent: Casting a Mobility Skill grants +100% Movement Speed for 2 seconds[/*] [*]35-50% Shadow Resistance[/*] [*]10-2% Mobility Cooldown Reduction[/*] [*][u]2-4[/u] Skill Ranks to Mobility Skills[/*] [*][u]3-4[/u] Skill Ranks to Shadow Imbuement[/*][/list] Power [list] [*]Mobility Skills are always Shadow Imbued with 40-80% increased potency. Lucky Hit: Damaging an Elite or Boss with a Mobility Skill has up to a 40-80% chance to instantly triggers a free Shadow Imbuement explosion.[/*][/list] [b]Slice and Dice Legendary Aspect[/b] [list] [*]Twisting Blades' initial hit cleaves. Twisting Blades return 25-45% faster.[/*][/list] [b]Bitter Infection Legendary Aspect[/b] [list] [*]Enemies infected by Shadow Imbuement take [u]30-70%[/u] of its damage every second. Shadow Imbuement deals [u]30-70%[x][/u] increased damage.[/*][/list][h3]Sorcerer[/h3] [b]Strike of Stormhorn Unique Focus[/b] Affixes [list] [*]Inherent: Chance for Ball Lightning Projectiles to Cast Twice is Now Chance to Cast a Super Ball Lightning[/*] [*]67.5-108.5% Critical Strike Damage[/*] [*]155-250% Ball Lightning Projectile Speed[/*] [*][u]1-3[/u] Skill Ranks of Ball Lightning[/*] [*]13-17.5% Chance for Ball Lightning Projectiles to Cast Twice[/*][/list] Power [list] [*]Ball lightning splashes on contact for 60-100%[x] increased damage and Stunning enemies for 1 second if it reaches its Maximum Range.[/*] [*]Super Ball Lightnings are larger, deal [u]125%[/u] more damage, have a higher Lucky Hit Chance, and its Stun duration is increased to 3 seconds.[/*][/list] [b]Okun’s Catalyst Unique Focus[/b] Affixes [list] [*]Inherent: Ball Lightning Can Be Cast While Moving[/*] [*]24-35% Attack Speed for 5 seconds After Casting a Defensive Skill[/*] [*]0.5-1.5% Damage Reduction for Each Active Ball Lightning[/*] [*]1-3 Skill Ranks of Ball Lightning[/*] [*]13-17.5% Chance for Ball Lightning Projectiles to Cast Twice[/*][/list] Power [list] [*]Ball Lightning orbits you, creating a static field that damages all enemies within for 140-180% of Ball Lightning’s damage per active ball, and granting Unhindered while the field is active.[/*][/list] [b]Of Mind’s Awakening Legendary Aspect[/b] [list] [*]Casting a Pyromancy Skill Immobilizes enemies hit for 0.5-1 seconds. Casting a Shock Skill grants a burst of 15-30% Movement speed for 1 second. Casting a Frost Skill grants a Barrier for 3-6% Maximum Life. While Enlightened, each Skill grants all benefits.[/*][/list][h3]Spiritborn[/h3] [b]Sustained War-Crozier Unique Quarterstaff[/b] Affixes [list] [*]Inherent: 45% Block Chance[/*] [*]132-188 Dexterity[/*] [*]610-1142 Maximum Life[/*] [*]21-35% Chance for Potency Skills to Deal Double Damage[/*] [*]2-4 Skill Ranks to Focus Skills[/*][/list] Power [list] [*]Your Focus Skills benefit from all their Upgrades, and they increase the damage of your Potency Skills by 10-20% for 8 seconds, up to 100-200%.[/*][/list] [b]Endless Talons Legendary Aspect[/b] [list] [*]Razor Wings hitting an enemy increases your Eagle Skill damage by 1%[x] for 4 seconds, up to 30-50%[x]. Razor Wing Critical Strikes grant 3 stacks.[/*][/list][h2]Eternal Updates: The Armory, and More[/h2][h3]The Armory[/h3] The Armory is here to stay! The ability to effortlessly swap between saved builds in town has arrived and will remain a feature in both Eternal and Seasonal Realms after Season of Witchcraft. [img]{STEAM_CLAN_IMAGE}/44681402/2058217459af2f3d90d3e15807fdc89c6408739c.jpg[/img] The Armory is a brand-new feature which gives you the option to Save, Load, and Name your favorite builds and the option to select those builds to change your Characters current loadout. The buttons to select each will are named after their function. The Armory is Character bound; you’ll have 5 Loadout slots per character. [img]{STEAM_CLAN_IMAGE}/44681402/90f357c0a29498a3709075be1f6f31b02ce9e9e1.jpg[/img] At a glance from your Loadout, you’ll be viewing Equipment, Skills, selected Paragon Nodes and Glyphs that make up your saved build. Note: changing between Loadout slots with differing Paragon loadouts does not cost Gold. [img]{STEAM_CLAN_IMAGE}/44681402/0ca683cacbb156795b6642bb196f779af573bcbe.jpg[/img] To use the Armory, start by selecting an empty slot and save your build to begin. Saving your loadout will capture the following: Equipped Items, Paragon Board and Glyphs, Skill Selections, and Class mechanic. The Armory can be accessed across each major city in Sanctuary, and end-game hubs such as the Citadel, Tree of Whispers, and Training Grounds in Kyovashad. If an item saved in your armory loadout is no longer available—whether from selling, trading, or salvaging—an icon will indicate the item is missing on the Loadout preview. [h3]The Welcome Back Booster is Here to Stay[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/cef5e8e09cbacd86d7231edb800298c35c88cfb0.jpg[/img] We’ve made some incredible updates for players on the Eternal Realm, first of which is that the Welcome Back Booster is here to stay. The ability to instantly boost an eternal realm character to Level 50, complete with Legendary Items, and pre-set class skills will now remain as a permanent feature in-game. For more details on the Welcome Back Booster, read our blog [url=https://news.blizzard.com/diablo4/24158873/]here[/url]. [h3]Tree of Whispers and General Updates[/h3] The Tree of Whispers has a new and improved layout for Season of Witchcraft, which will remain past the Season’s end. Additionally, each Class mechanic quest completion is now account bound. Once you’ve completed the Class specific quest once, it’ll be completed for any new Character of the same class. You’ll unlock your specific Class mechanic at the Level where the Class mechanic quest would have become available. For example, after completion of the “True Potential” quest for the Rogue, upon reaching Level 15 on your next Rogue character, you’ll automatically unlock the Specialization mechanic. For those savvy buildcrafters looking for the perfectly rolled item across Sanctuary, unique items with Greater Affixes are improving. When a unique item has more Greater Affixes, the minimum roll of the unique power will be increased per Greater Affix. This better aligns with the overall power of the item, which makes items with 3-4 Greater Affixes feel really impactful. [h3]New and Updated Runes[/h3] For Vessel of Hatred players to employ, the Alchemists of Sanctuary have been toiling to craft new sources of arcane power, use these potent sources of magic for dastardly deeds or enlightened benefaction. Check the [url=https://news.blizzard.com/diablo4/24171214/]Season of Witchcraft patch notes[/url] on January 16 to see all balance updates to Runes. [img]{STEAM_CLAN_IMAGE}/44681402/a55ea673a624932ba9b5dd7c0a3875c21cb0ffa2.jpg[/img] [b]New Ritual Runes[/b] Nagu Legendary Rune [list] [*]100 Offering generated.[/*] [*]Maintain at least 1 active Summon for 5 seconds, gaining Offering for each up to 6 Summons.[/*][/list] Igni Legendary Rune [list] [*]25 Offering generated.[/*] [*]Stores offering every 0.3 seconds. Cast a non-Basic Skill to gain the stored offering. (Up to 500 Offering).[/*][/list] [b]New Runes of Invocation[/b] Chac Rare Rune [list] [*]Costs 20 Offering[/*] [*]220% weapon damage[/*] [*]Invoke Druid Lightning Bolts, striking a nearby enemy[/*] [*]Overflow: Spawn more Lightning Bolts[/*][/list][h2]Unlock Rewards with the Season Journey and Battle Pass[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/3936cf5fe3d60dd2675c2eab0a3696f7270167bf.jpg[/img] As you cleanse Sanctuary’s soil with the constant flow of demon blood, you’ll earn rewards from the Season Journey and Battle Pass. [img]{STEAM_CLAN_IMAGE}/44681402/9d02df4690c864a156025672ad9972abd6fdc48c.jpg[/img] The Season Journey is broken into Chapters with tasks to complete. As you progress through the Journey, you’ll earn rewards befitting a defender of Sanctuary such as a Resplendent Spark. The Journey also provides Favor—the resource used to climb through the Battle Pass’ Tiers— earnable simply by playing aspects of the game. Completing the Season Journey will give you Dorian the Raven as a Pet to use in-game, our first avian Pet! [img]{STEAM_CLAN_IMAGE}/44681402/4ba217f3729bfca9280bc77865509bf48aa85177.jpg[/img] [img]{STEAM_CLAN_IMAGE}/44681402/82fffaa5d8c370cec2bba4af219aec60a3ba764d.jpg[/img] [h3]Revitalize Your Soul with New Finery[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/d0cbbeec97ad5614c641fd93ac6632ebea2d26d7.jpg[/img] The Season of Witchcraft Battle Pass begins on January 21, 10 a.m. PST and hosts 90 Reward Tiers (28 Free Tiers and 62 Premium Tiers). Smoldering Ashes earned from the Free Tiers can be spent on Season Blessings that provide helpful bonuses to beat back Hell’s armies. There are 3 new Blessings for Witchcraft: [list] [*]Urn of Whispers: Boost the chance to receive a Greater Collection from Whisper rewards.[/*] [*]Urn of Masterworking: Boosts the chance for existing sources to drop additional Obducite.[/*] [*]Urn of Rot: Boost the amount of Restless Rot dropped by slain Headrotten. Use Restless Rot to upgrade your Witchcraft Powers.[/*][/list] The bonuses gained from the 5 Season Blessings only last until Season of Witchcraft ends. If you get the Premium Battle Pass, not only will the rewards of the Free Tiers be yours to wield, but Grand High Witch Armor Set, Platinum, and more also await you, including the Nightwinder Mount and Nightwinder Mount Armor, which unlock at Tier 90. The Accelerated Seasonal Battle Pass also contains 20 Tier Skips and the Magic of Mushrooms Emote. [h2]Acquire Fabled Threads from Tejal’s Shop[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/09cc4ae1edf2a583dd7a7800861f59df5125a2a4.jpg[/img] We’re dialing up the heat in the Shop with new Equipment, Armor, Accessories, Mounts, and Mount Armor bundles that will have you slaying in style. Starting on January 21 at 12 p.m. PST, visit Tejal to browse her wares—remember to check back often, as she’ll update her stock throughout Season of Witchcraft. One such rarefied find from the far reaches of Sanctuary is the Daemon Knight bundle for Spiritborn, which contains the Daemon Knight Armor Set, Soulsreap Glaive cosmetic, Exobane Quarterstaff cosmetic, and Diabolical Anthem Marking for all your Spiritborn characters. This bundle can be purchased from Tejal's Shop for 2,800 Platinum. [h2]Community Guides for Season of Witchcraft[/h2] If you need sage guidance in your character’s journey throughout the season, look to our Community guides for tips and insights on builds for every class. From early game levelling, all the way to end-game builds, they’ve got you covered! Visit our trusted Community resources here: [list] [*][url=https://maxroll.gg/]Maxroll[/url][/*] [*][url=https://www.icy-veins.com/]Icy Veins[/url][/*] [*][url=https://www.wowhead.com/diablo-4]Wowhead[/url][/*] [*][url=https://www.purediablo.com/]PureDiablo[/url][/*] [*][url=https://Mobalytics]Mobalytics[/url][/*][/list][h2]Tune in to the Next Developer Update Stream[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/59a34f3fff4945ee665d173ac74a79660872c185.jpg[/img] Our next Developer Update stream begins on [b]January 16[/b] at [b]11 a.m. PST[/b] and details everything for Season of Witchcraft. Join members of the development team as they go through learnings from the December Public Test Realm, system updates, and more. Visit our official Diablo [url=https://www.twitch.tv/diablo]Twitch[/url], [url=https://www.youtube.com/Diablo]YouTube[/url], X (formerly Twitter), and [url=https://www.tiktok.com/@diablo]TikTok[/url] channels to watch live! Following the Stream’s conclusion, we’ll post another article with a video of the chat so you can catch up on the details if you miss them. May the Witches of Hawezar deem you valiant enough to harness their wicked ways. —The Diablo IV Team", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6350729003513011640", "title": "Diablo IV | Vessel of Hatred", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6350729003513011640", "date_utc": "2024-10-08T17:03:27+00:00", "contents": "[previewyoutube=kpOW5alWgYU;full][/previewyoutube] Hatred's corruption is released upon Sanctuary ☠️ Vessel of Hatred is live now 🐺 [url=https://store.steampowered.com/app/3043530/Diablo_IV_Vessel_of_Hatred/?snr=1_4_4__118]Purchase today and experience the next chapter in Diablo IV[/url]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6339469370200659582", "title": "What You Need to Know for Vessel of Hatred’s Launch", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6339469370200659582", "date_utc": "2024-10-01T16:03:00+00:00", "contents": "The grand River Gates of Nahantu are waiting, and a tortured Neyrelle drifts further within. This tormented mortal suffers the seemingly endless machinations of the Prime Evil Mephisto trapped within the Soulstone. Become the Spiritborn, and cleanse the jungle of Hatred’s minions with this all-new ferocious class. [previewyoutube=kpOW5alWgYU;full][/previewyoutube] A new Era of Diablo IV is nearly upon you, wanderer. Directly following the events of the main campaign, a new chapter launches you back into the fire. Track down the lost Neyrelle while the people of Nahantu fight the hatred-fueled demons spreading through their sacred land. Read on to learn everything you need to know when [b]Vessel of Hatred[/b] launches on [b]October 7[/b] at [b]4 p.m. PDT[/b]. [h2]Last Chance for Pre-Purchase Rewards[/h2] The light is fading over the plains of the Teganze, providing the faintest glimmer of spoils yet claimed. Your final chance to receive coveted items befitting a wanderer of your prowess draws near. [img]{STEAM_CLAN_IMAGE}/44681402/5d8b14bb93c8772cf37e8c30f638682ed44b69d8.jpg[/img] This is your last chance to claim the following pre-purchase bonus items by securing the Vessel of Hatred Ultimate Edition. [list] [*]Alkor, Snow Leopard Pet* (Pre-Purchase Bonus)[/*] [*]Mother’s Lament Legendary Gem for Diablo Immortal** (Pre-Purchase Bonus)[/*][/list] For full details on Vessel of Hatred pre-purchase, [url=https://diablo.com/#purchase]see here[/url]. [i]*Mount or pet feature (as applicable) must be unlocked in-game before the item can be used.[/i] [i]**Diablo Immortal® downloaded separately.[/i] [h2]Launch and Pre-Load Schedule[/h2][h3]Vessel of Hatred Release Timing[/h3] Akarat's followers have anticipated your return, wanderer. Vessel of Hatred and our upcoming season will go live on [b]October 7[/b], at [b]4 p.m. PDT[/b]. For a helpful guide to see where it goes live across the world, see our global release map here: [img]{STEAM_CLAN_IMAGE}/44681402/5c04d845b2470101b3c090e0f03a85b93f3e1c71.jpg[/img] [h2]Play the Vessel of Hatred Campaign[/h2] The Vessel of Hatred Campaign requires you to have purchased the Vessel of Hatred expansion. To begin, create a new Character on either the Eternal or Seasonal Realm or play as an existing character from the Eternal Realm. You can select to “Skip Campaign,” if you want your new Character to go right to the beginning of the Vessel of Hatred Campaign. For those new to Diablo IV, we recommend starting your journey by completing the base game campaign for the full experience before beginning the Vessel of Hatred campaign. However, if you’re eager to go immediately to the expansion content, you will need to complete the prologue for the main campaign on one character to unlock the option to skip the main campaign on a newly created character. [h2]Vessel of Hatred Contents and Base Game Updates[/h2] Vessel of Hatred arrives alongside major updates that will be available to all Diablo IV players, such as systemic changes to levelling, difficulty tiers, the Paragon System, and more. To help shed light on all that arrives to the base game—and what remains solely within Vessel of Hatred—we have listed out the contents that are specific to both. [h3][b]New Base Game Content—Available to all players[/b][/h3][list] [*]New Max Level: 60*[/*] [*]New Difficulties System[/*] [*]New Paragon Max Level: 300[/*] [*]Paragon System Changes[/*] [*]Item Quality Rework[/*] [*]2 New Character Slots[/*] [*]New Class Skills and Passives for each Class[/*] [*]New Party Finder Feature[/*] [*]New Seasonal Content[/*] [*]New Season Rewards (Season Journey, Battle Pass, Reputation Board)[/*][/list][h3][b]Vessel of Hatred Expansion—Available to Vessel of Hatred Owners[/b][/h3][list] [*]Nahantu Region–including Dungeons, Strongholds, Side Quests, new Legion Events, and Nahantu Monster Families**[/*] [*]Spiritborn Class[/*] [*]Vessel of Hatred Campaign[/*] [*]Nahantu Region Renown[/*] [*]Runewords[/*] [*]Dark Citadel[/*] [*]Mercenaries[/*] [*]Kurast Undercity[/*] [*]Trading for Vessel of Hatred-specific Resources[/*][/list] [i]*Note that any characters which are Level 51 and above will be set to Level 50 at the start of this update.[/i] [i]**One of the Nahantu Monster Families will appear within the new Seasonal content—stay tuned for more details.[/i] Visit our other blog posts to get full details on [url=https://news.blizzard.com/diablo4/24130178/]progression and Paragon System changes[/url] coming to the base game, learn more about the [url=https://news.blizzard.com/diablo4/24107497/]new Spiritborn Class[/url], and uncover information on [url=https://news.blizzard.com/diablo4/24128995/]Mercenaries, the Dark Citadel, and Kurast Undercity[/url]. [h2]Glorious New Rewards Await[/h2] While the Skittering Earth holds unsightly abominations, these forsaken lands also hold tantalizing splendor to be found amongst the ruins and gargantuan flora of Nahantu. Upon log-in to Diablo IV, claim three new items from the in-game shop to celebrate the Vessel of Hatred launch. [img]{STEAM_CLAN_IMAGE}/44681402/3324683a03fb141292888f9a35afa5d3498304a9.jpg[/img] For those intrepid groups of wanderers who manage to best the challenging First Khazra riddled halls of the Dark Citadel, glorious prizes await. From [b]October 8—November 8[/b], if you manage to complete the Dark Citadel you will earn the [b]Reins of the Longfur Beast[/b], a formidable Cat mount to mark your prowess alongside the weekly reward cache to mark your prowess. Don’t forget to leverage the new Party Finder to help find other like-minded players to join arms with to battle through the Citadel. [h3]Stream Vessel of Hatred on Discord[/h3] From [b]October 8—October 15[/b], stream yourself playing Diablo IV on Discord and earn the mighty [b]Sea of Voices Weapon Bundle[/b]. To earn these tools of demonic dismemberment, check the Discover tab in Discord to accept this Quest, and then stream at least 15 minutes of Diablo IV to your friends on Discord. Once you’ve completed this, you’ll earn a code in Discord that can be redeemed online here, or in the Battle.net App. While you can only redeem the code online or in Battle.net, the rewards are eligible for all platforms. This Discord Quest is eligible on PC for any region where both Diablo IV and Discord are available. If you need a place to share your journey into Nahantu to earn these rewards, head to the Sanctuary Discord and stream to fellow wanderers in there. You can join the Discord at [b]discord.gg/diablo4[/b]. [h2]Twitch Drops[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/aad84c6ae3e205467f0a50a622f10a6b5fbcc320.jpg[/img] While it can be adrenaline pumping to brave the ferocity of Hatred’s minions, much can be gleaned from observing others attempt the same feats. From [b]October 8—November 5[/b], keep your favorite Diablo IV streamers company by watching the Diablo IV Category on Twitch as they rain demonic viscera from the dense jungle canopies. You’ll earn [b]new Twitch Drops each week[/b] that will reward Cosmetic items such as Weapon skins, re-colors, and Back Slot items. Gift or purchase 2 Twitch Subscriptions to a streamer within the Diablo IV directory, and you’ll earn the new [b]Ghost of the Conquered Mount[/b], while 4 subs earns you the [b]Glory of the Victor Mount Armor[/b]. For full details on the Vessel of Hatred Twitch Drops, you can read our [url=https://news.blizzard.com/diablo4/24140802/]blog here[/url]. [h2]Community and Player Support[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/809f7341bd235c567a74fd29ac327f0760035d22.jpg[/img] Just as the Lacuni are relentless in securing their kill, we are adamant on creating a seamless Vessel of Hatred launch for you. In the event you encounter any hellacious interruptions during pre-load or launch, please reach out to us through the [url=https://us.forums.blizzard.com/en/d4/]Diablo IV Forums[/url], [url=https://twitter.com/BlizzardCS]Blizzard CS Twitter account[/url], or the [url=https://blizz.ly/3MWtNIF]Player Support Portal[/url] to mend any issue you’re experiencing. [h2]Thank You from the Diablo IV team[/h2] From the announcement of Vessel of Hatred at BlizzCon 2023 to release nearly a year later, the journey has been extraordinary. We’ve spent countless hours designing this new entry into Diablo IV and can’t wait to jump into the action with you next week. This feat couldn’t have been achieved without your feedback and support. Thank you for everything! The Spiritborn and many adventures wait for you in the deep jungles of the Teganze. Good luck, and may you survive Nahantu. -The Diablo IV Team", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5746109972560576034", "title": "Prepare to embody the Spiritborn: Pre-purchase Vessel of Hatred", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5746109972560576034", "date_utc": "2024-06-09T18:18:14+00:00", "contents": "Vessel of Hatred™, the first expansion for Diablo IV, is now available for pre-purchase through Steam and will release on October 8. Deep in the jungles of Nahantu, a conflicted Neyrelle is tormented by the malicious wills of her travelling companion Mephisto. Can you navigate the terrors that lay in wait to save her soul, or will it already be too late? Harness the powers of an all-new class to survive the deadly wilds and fight back the terrible power from within. Pre-purchase Vessel of Hatred™ Ultimate Edition and immediately receive* Alkor the Snow Leopard Pet, Natalya the Tiger Pet, and Hlrati the Canine Pet, plus the Nahantu War-cat Mount Bundle**, Wings of the Faith cosmetic, 3,000 Platinum, armor sets for each class, and more. For an overview of everything we announced today, here is a message from game director Brent Gibson! [previewyoutube=nAaI9n30dxE;full][/previewyoutube] For more information related to pre-purchasing Vessel of Hatred and beyond, feast on the details included below! [h2]Pre-purchase Vessel of Hatred Today[/h2] The jungles of Nahantu bleed across Sanctuary when you pre-purchase the Vessel of Hatred Expansion. Not only does pre-purchasing grant you access to Vessel of Hatred when it launches on [b]October 8[/b], but it also immediately grants you a bevy of in-game rewards to begin your journey today! Pre-purchase the Diablo IV Vessel of Hatred-Ultimate Edition and receive: [img]{STEAM_CLAN_IMAGE}/44681402/d8fa9eebc80446c696623821b57daf4478427b3c.jpg[/img] [list] [*]Diablo IV: Vessel of Hatred Expansion***[/*] [*]Nahantu Veilwalker Spiritborn Armor***[/*] [*]Alkor, Snow Leopard Pet** (Pre-purchase Bonus)[/*] [*]Mother’s Lament Legendary Gem for Diablo Immortal**** (Pre-purchase Bonus)[/*] [*]Hratli, Canine Pet**[/*] [*]Nahantu War-Cat Mount and Armor Bundle**[/*] [*]One Premium Battle Pass Token[/*] [*]3,000 Platinum[/*] [*]Natalya, Tiger Pet**[/*] [*]Nahantu Unearthed Armor Bundle (5 class armor sets)[/*] [*]Wings of the Faith Cosmetic[/*] [*]Nahantu Themed Town Portal[/*][/list] Pre-purchase the Diablo IV Vessel of Hatred-Deluxe Edition and receive: [img]{STEAM_CLAN_IMAGE}/44681402/f8dbf0d54618c9eb3c4034eb4058f45436a6ecc5.jpg[/img] [list] [*]Diablo IV: Vessel of Hatred Expansion***[/*] [*]Nahantu Veilwalker Spiritborn Armor***[/*] [*]Alkor, Snow Leopard Pet** (Pre-purchase Bonus)[/*] [*]Mother’s Lament Legendary Gem for Diablo Immortal**** (Pre-purchase Bonus)[/*] [*]Hratli, Canine Pet**[/*] [*]Nahantu War-Cat Mount and Armor Bundle**[/*] [*]One Premium Battle Pass Token[/*][/list] Pre-purchase the Diablo IV Vessel of Hatred-Standard Edition and receive: [img]{STEAM_CLAN_IMAGE}/44681402/e1b792a04b185428c97c713be34f9c5a631225eb.jpg[/img] [list] [*]Diablo IV: Vessel of Hatred Expansion***[/*] [*]Alkor, Snow Leopard Pet** (Pre-purchase Bonus)[/*] [*]Mother’s Lament Legendary Gem for Diablo Immortal**** (Pre-purchase Bonus)[/*][/list] [h2]Diablo IV: Expansion Bundle[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/7eabdd4f093c1d3aaf34c7adeabc261db0bf36b7.jpg[/img] For those who have not yet battled against the prophesized return of Lillith, start demon-slaying today and prepare for the next chapter of Diablo IV to unleash. Pre-purchase the Diablo IV Expansion Bundle and receive the following items: [list] [*]Diablo® IV Base Game – playable today![/*] [*]Diablo IV: Vessel of Hatred Expansion***[/*] [*]Mother’s Lament Legendary Gem for Diablo Immortal**** (Pre-purchase Bonus)[/*][/list] [i]*Diablo IV base game required. After purchase, instantly available items will be delivered in-game after next login.[/i] [i]**Mount or pet feature (as applicable) must be unlocked in-game before the item can be used.[/i] [i]*** Available upon Vessel of Hatred release on October 8, 2024.[/i] [i]****Diablo Immortal® downloaded separately.[/i] [h2]Introducing our Newest Class: The Spiritborn[/h2] Ranked among the apex predators of the jungle, the Spiritborn is an entirely new class to the Diablo Series. They are battle-hardened with mystical synergies that could only be awakened deep within the jungles of Nahantu. Become one of the Spiritborn and embrace the ethereal Spirits entwined with this ancient civilization. While this Class remains shrouded in mystery, all shall be revealed in time. Join us for our Spiritborn Class Reveal on [b]July 18[/b], where the team will take an in-depth look to learn more about this groundbreaking Class. [h2]Explore Nahantu[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/5e2afce10a5db2178a4bb4a34bd4df27f77a82e5.png[/img] Sanctuary expands to the vast region of Nahantu, beckoning you forth. Wanderers of yore may recall echoes of Nahantu in Diablo II. Experience everything from forgotten ruins to new Towns and take on new dungeons, Strongholds, and the warring tribes scattered throughout the region. Will you survive amongst the hellish overgrowth of Kurast or the barren desert plains of Teganze? [h2]Experience the next Dark Chapter of the Main Campaign[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/ffb4c3d1ed5075c663cfade6956dac638883fe64.png[/img] Prepare for the next riveting chapter in the main story of Diablo IV. Starting where she last left us, the search for Neyrelle takes you deep into the ancient jungle as she grapples with the imprisoned Prime Evil. Attempt to unravel Mephisto’s dark plot while new foes encircle your every move, planning your demise. The fate of Neyrelle’s soul--and her ability to stop this Prime Evil from destroying Sanctuary--rests in your hands. [h2]Mercernaries, End-game Activities, and Game Updates[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/40a432a1a3dab06873363a03ee6eb729b0890a18.jpg[/img] [h3]Mercernaries[/h3] Is it not better to wander with a friend by your side? Never fight alone as Mercenaries can join you on your quest to battle side by side with you in the dense undergrowth of Nahantu and beyond. These powerful allies grow in power as they progress, and each are equipped with unique abilities to help you in combat. [img]{STEAM_CLAN_IMAGE}/44681402/b8bc76c4ef0ae8cba4908f6bc99281fb33b098a3.jpg[/img] [h3]New PvE End-Game Co-Op Activity[/h3] Lurking within the shadows lies your next great challenge, filled with powerful tribulations and promising rewards. First of its kind to Diablo, this dungeon will require eager warriors to team up and take down various perils together. More details on this game mode will be revealed soon. [h3]Base Game Updates[/h3] At Vessel of Hatred launch, we will also be introducing various updates across the entire game to improve and re-work core systems that have been around since launch. Empower your favorite Classes with new Skills, added Paragon Boards, and Legendary Glyphs. Explore new Dungeon types, added activities and rewards from the Tree of Whispers, and more. [h2]A Wanderer’s Best Friend: Pets[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/125f58cb328b541730d4122efe1db10247aa1ad7.png[/img] Available in-game now, all players in Diablo IV can have a new companion to call their own. Aiding with Gold and Material pick-up, Pets will serve as your trusty sidekick throughout the dangerous world of Sanctuary. Log-in now to receive a Quest in-game that unlocks Pets for your Character. Upon Completion, you’ll earn Asheara the Canine Pet in-game. [img]{STEAM_CLAN_IMAGE}/44681402/d245f8fd128a9f31c35e8f48af3b551afa266d11.png[/img] Pre-purchased Editions of Vessel of Hatred will instantly grant you Alkor the Snow Leopard Pet, Natalya the Tiger Pet, or Hlrati the Canine Pet, or get all three with the Ultimate Edition! [img]{STEAM_CLAN_IMAGE}/44681402/45d11e41ceb73ccb70d8a188ee5fd85271c9a3e1.jpg[/img] [h2]Diablo Anniversary Celebrations[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/3f979bbe0d6e5f1a1a5d00a3f46672e89b25e2a2.jpg[/img] The fires in our hearth burn brightly with Diablo IV anniversary celebrations, for Mother’s Blessing is live now in-game! From June 9—June 19, earn Experience at 25% and Gold at a 50% (multiplicative) increased rate. For full details on our Diablo anniversary celebrations, you can see our blog here. May the creatures of the jungle be merciful... or swift. —The Diablo IV Team", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5768625435414636474", "title": "Galvanize your Legend in Season 4: Loot Reborn", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5768625435414636474", "date_utc": "2024-05-14T18:26:34+00:00", "contents": "The forges burn with renewed vigor, stoked by braziers to hone the steel of Sanctuary’s finest. Across the land, Hell’s expanded Legions gather and multiply, marshalling their strength to ambush wanderers that fall prey to their Helltide. Season 4: Loot Reborn begins on [b]May 14 at 10 a.m. PT[/b]. Use the Itemization overhaul on new systems, Tempering and Masterworking to change a noteworthy blade into a force to be feared. Across all World Tiers, Helltide is reborn: slay monstrosities to fill your threat meter, marking you as prey for the [b]Hellborne[/b]. Prepare to fight side by side with the [b]Iron Wolves[/b]—a seasoned mercenary company of brethren aiming to quell the demons. [h2]Itemization Reforged: Masterworking, Tempering and More[/h2] Seasons within Diablo IV bear their mark on Sanctuary in the Seasonal Realm, unearthing new quests and fresh mechanics to explore and master. Season 4: Loot Reborn takes on a new theme, overhauling many core game systems to refresh how items are earned, how they function, and how they improve as you level through World Tiers during the season. Unlike previous Seasonal themes that affect only the Seasonal Realm, with Season 4: Loot Reborn, these Itemization changes persist beyond the Seasonal Realm and affect the Eternal Realm as well. Read on to learn how Itemization will change the way you loot and reap your way across all of Diablo IV. All updates to our new items, Classes and Skills will be available in our [url=https://news.blizzard.com/diablo4/23964909/]Season 4 Patch Notes[/url]. [h3]General Item Updates[/h3] One of our several goals for the Itemization changes is to make it easier to understand which items are upgrades when they drop. We reduced the number of affixes on items (down to 3 on Legendary items, 2 on Rare items) and made these affixes more effective. Instead of seeing an affix that relies on conditional values (+10% damage on non-injured Elites), you'll see affixes such as base increases to your Movement Speed, Max life, or single ranks of a Core Skill. Dropped Items are now simpler to evaluate, and we've moved their complexity and customization to our new crafting systems, Tempering and Masterworking, which we will describe in more detail below. We've also increased the overall values of these affixes, so they should feel more powerful! [img]{STEAM_CLAN_IMAGE}/44681402/de086b7caeef75f50342882e2db3cb213dae4b71.png[/img] [i]This screenshot displays an item under the Itemization changes with a Greater Affix.[/i] [img]{STEAM_CLAN_IMAGE}/44681402/696559dc11bd551f8909aabf19bb1d39d9a9fb3b.png[/img] [i]Item affixes after Itemization changes, with Tempering and Masterworking applied.[/i] By making items more individually impactful, we’ve significantly decreased the number of items that drop when slaying Monsters. The goal here is to spend more time obliterating and less time sorting through the many items that drop. The result is that fewer items will drop overall, but those items will be more likely to be valuable. To compensate and stay on par with the norm, materials gained from Salvaging and Crafting have been adjusted to match this change. Also, Forgotten Souls can now be earned from Whisper bounties and are a rare drop from all Elites. The Gold cost to re-roll items when Enchanting now has a maximum, and we’ve cut down on the materials needed to perform all activities when at the Blacksmith. Additionally, which World Tier you play in will directly affect the rarity of the items you earn. Sacred items or higher only drop in World Tier III, and only Ancestral items will appear in World Tier IV. Similarly, Legendary items dropped from enemies over Level 95 will always have a value of 925 Item Power. However, keep an eye out for Uniques—some have a chance to appear starting in World Tier I and II. All Uniques have a chance to drop starting in World Tier III, and Uber Uniques can start appearing as once you’re killing monsters that are Level 55 at max Item Power level. [h3]Codex of Power Updates[/h3] Salvaging Legendary items stores their powers as Legendary Aspects in your Codex of Power to be reused indefinitely. You can upgrade your Legendary Aspects by salvaging legendary items of higher power value at the Blacksmith. Instead of taking up space in your inventory, any legacy Aspect items you may possess will automatically be converted into appropriate upgrades in your Codex of Power when you first log in after Season 4 begins. [img]{STEAM_CLAN_IMAGE}/44681402/e504cb3175727a36de780c0820e67c9d2dc7b745.png[/img] The Codex of Power displays all available Aspects, so you can spend more time seeking the highest Aspect rolls possible. Once you have upgraded an Aspect to its maximum potential value, a specific border indicates the Aspect has been completed. [img]{STEAM_CLAN_IMAGE}/44681402/09c9475e45893d22a730e5b8e41ba30a06ddba84.png[/img] Aspects can now be searched, filtered, and favorited within the Codex of Power. When selecting a power for imprinting at the Occultist, an icon and a tooltip will denote which powers you already have equipped. Note that in the Seasonal Realm, when the Season ends, your Codex of Power will be transferred to the Eternal Realm. If you already have the same Aspect learned in the Eternal Realm, the Codex of Power will keep the higher value of the two. [h3]Tempering: Sharpen your Steel and make it Sing[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/0be356d095157f6ed1bc22baa836a781093d4403.png[/img] As you find and learn Tempering Manuals, Blacksmiths across Sanctuary will be able to use these manuals of craftsmanship to shape the qualities of your equipment. Tempering allows you to add potent affixes to your item. [img]{STEAM_CLAN_IMAGE}/44681402/617f7dec5a912536ec4f9e98fb554742e288a7a1.png[/img] Crafting Manuals can be found as a regular item throughout the game. Once learned, they can be used as many times as desired (like the new Codex of Power changes). Each Crafting Manual contains a small number of affixes, and typically correspond to six different categories: Weapons, Offensive, Defensive, Mobility, Utility and Resource. Simply head to a Blacksmith to Temper your item and add one of the available affixes, greatly reducing the time it takes to ensure your weapon has the affix you desire. Note that Ancestral items can have two Tempered affixes from different categories! [img]{STEAM_CLAN_IMAGE}/44681402/1c98f1ea12f08cd205221fa48597d21ec45d0398.png[/img] Remember, the Tempering Durability indicates how many times you can Temper an item…even the most battle honed blades can lose their edge. The manuals you learn on the Seasonal Realm last until the end of the season, and manuals learned on the Eternal Realm will be known permanently. [h3]Masterworking: Refine your Weapon to Untold Prowess[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/be25af198e7751f2e4d9e3d3dfcfdb4640be2d11.png[/img] Using the rarest of materials found within the deepest mines and caverns, improve your weapons to the absolute pinnacle of their potential. Masterworking is an end-game crafting system, using materials earned from The Pit of Artificers to upgrade your weapons. Masterworking improves the overall strength of all affixes on your weapon, and at every 4th tier, massively upgrades one of your equipped affixes. The affix that receives the bonus will turn Blue. If the same affix is improved again, it will change to Yellow, and in rare cases, it will turn Orange if improved a third time. [img]{STEAM_CLAN_IMAGE}/44681402/7262c7b4faef6c540dbf036f1609850606008355.png[/img] If you hit the max level of Masterworking on a given weapon and you’re unsatisfied with the improvements on your weapon, you can reset and begin the process again. [h3]Greater Affixes[/h3] Appearing only on Ancestral Legendary and Unique Items, Greater Affixes are 1.5x more powerful versions of normal affixes. Items with Greater Affixes drop with a distinct audio cue, alerting you to their presence, and have a unique icon both in the world and within your inventory. Each affix on an item has a chance to be a Greater Affix in World Tier III and IV. You cannot Enchant an affix into a Greater Affix—their awesome power may only be discovered. [h3]Gems[/h3] Gems are simpler, streamlined and more effective across your Character’s journey. Crude Gems have been removed, and crafting levels have been shifted back. Normals Gems are available at Level 51, Flawless at 71, and Royal at 91. Diamonds have had their All Resistance values increased. Topaz now provide increases to Intelligence, and Sapphires increases to Willpower. Amethyst increases your Strength, and Emeralds now provide bonus Dexterity. [h2]Helltide Reborn[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/a1f7a2ece308ee31a620b5a6562571a3381293ff.jpg[/img] The legions of the Burning Hells regroup to coordinate a most formidable display of force in a Helltide reborn. Inspired by the Vampiric Blood Harvest in Season of Blood, your ferocity in combat draws the attention of increasingly dangerous foes. Only the strongest and most well-prepared can survive this potent onslaught. Unless otherwise noted, these Helltide changes affect both Eternal and Seasonal realms and persist beyond the end of Season 4: Loot Reborn. [h3]Threat Levels and Becoming Hell-Marked[/h3] As you cleave your way through Helltide, you will now generate Threat. Threat is earned based on the difficulty of the monsters you slay and how often you’re opening Tortured Gifts within Helltide. There are three Threat Levels in total, with each level increasing the danger and frequency of ambushes. Once you hit Level 3, you will become Hell-Marked. [img]{STEAM_CLAN_IMAGE}/44681402/127bd92fb85a606137ac6d51b41b0510b2646099.png[/img] When you’ve been Hell-Marked, you’ll be besieged by a frenzy of densely packed monsters. If you make it out alive, a Hellborn will come for you: one of Sanctuary’s most formidable fallen warriors, now an immensely powerful agent of Hell. The Hellborn can embody one of the classes in Diablo IV. Your Threat Level resets once the Hellborn ambush has been activated, or if you succumb to the overwhelming forces of Hell and perish. [h3]Unholy Blasphemy: Accursed Ritual[/h3] At a scene of shocking gore, the Accursed Ritual is the ultimate testament to the disturbing lengths these manic Cultists will go to appease their dark desires. It is here where you can begin the Accursed Ritual. [img]{STEAM_CLAN_IMAGE}/44681402/d8e6bd11f614022fc3a37e34f8a4e33ed1b113f0.png[/img] Baneful Hearts can be earned by opening Tortured Gifts throughout Helltide and by defeating Hellborn enemies. Deposit three Baneful Hearts to begin the ritual, which will commence with a swarm of demonic enemies. This ambush will end with the arrival of the formidable Blood Maiden, an immensely powerful demon who offers great reward upon her death. Contributing any Baneful Hearts to initiate this dark ritual will grant you increased rewards as a contribution bonus. [h3]Helltides in World Tier I and II[/h3] To get your feet warmed up to the awesome threat of Helltide earlier on in your character’s journey, Helltide is now available in World Tier I and II. The overall Monster density will be suited relative to these World Tiers, and no roaming bosses will be present. [img]{STEAM_CLAN_IMAGE}/44681402/26c6d443505656539278a88a6d7486f1c3f09709.jpg[/img] [h3]Additional Hellish Changes[/h3] For the wanderer that want to push the limits of Helltide, an exceptionally valuable new elixir called [b]Profane Mindcage[/b] is available to up the ante. Consuming a Profane Mindcage increases the level of Helltide Monsters by 10 and boosts Cinder drop rates. These are a guaranteed drop after killing Hellborne. You will see diminishing returns on boosted Monster levels closer to level cap—keep progressing in World Tiers to retain the same benefit from this potent elixir. The Profane Mindcage will only last until the end of Season 4: Loot Reborn. Fresh demonic events have been added to Helltide, including new encounters with the fabled Iron Wolves. Stay vigilant for these encounters of demonic treachery. [img]{STEAM_CLAN_IMAGE}/44681402/c2235e55764a26159a14021a97f86a5e378b6dda.jpg[/img] As a recent change since our Public Test Realm for Season 4: Loot Reborn, Doomsayers no longer drop Chests of Doomsaying. Instead, they now drop the equivalent rewards that a Chest of Doomsaying would have granted on death—entirely removing the Cinder cost it previously held. [h2]Your Greatest Challenge: The Pit of Artificers[/h2] There are rumors that there are strange varieties of ore deep within the network of dungeons crisscrossing the north of Sanctuary, perfect for crafting exceptionally-made armor using secret Horadric techniques. However, the horrors that lay in wait for intrepid wanderers seeking to unearth these riches are unspeakably terrible. Upon entering World Tier IV, you’ll receive a priority Quest to complete a Tier 46 Nightmare Dungeon. Upon completion, you’ll begin to collect Runeshards by playing through different Endgame activities. They’ll appear when you encounter Helltide Chests, World Bosses, Legion Events, Nightmare Dungeons and Whisper Bounties. Collect Runeshard to activate the Obelisk in Cerrigar, allowing you to descend into the beckoning depths of The Pit. Your task is to slay enough monsters before your 10-minute time limit runs out to summon a final boss. Each player death removes time from the clock: first death removes 30 seconds, second death removes 60 seconds, third and subsequent deaths will remove 90 seconds. After enough monsters are slain, a portal materializes, transporting you to the boss’s arena. Slay the boss before the timer expires to earn coveted Masterworking materials… and the next brutal tier of The Pit. If you can manage to kill the boss with time left on the clock, the benefit increases. With 4-6 minutes to spare, you skip a level and unlock an additional Tier of the Pit. Killing the boss with 6 or more minutes to spare grants you two additional Tier unlocks. The Pit has 200 total levels of difficulty to try and conquer, if you dare face the challenge. The Pit can be entered in groups of up to four players, with the player who spends the Runeshards to open the Pit earning the lion’s share of materials. Only the player who opened The Pit has the chance to receive tantalizing Stygian Stones used for summoning Tormented Echoes—Level 200 variants of the summonable bosses found in Diablo IV. The further you descend into levels of The Pit, the more frequent these Stygian Stones will appear. [h2]Andariel Joins the Fray & Tormented Echoes[/h2] The Maiden of Anguish has returned in all her tormented glory. She joins the boss ladder at the same tier as her brother Duriel, with the same Uber Unique drop rate. With a mix of Shadow, Fire, Lightning, and her iconic Poison attack, Andariel stands ready to face all who dare fathom to bring about her demise. Found east of Tasarak, in Hanged Man’s Hall, you’ll need summoning materials from both Lord Zir and Beast in Ice to fight Andariel. [h3]Tormented Echoes[/h3] All summonable bosses are now available at Level 200 as Tormented Echoes. Summonable with their regular summon Materials alongside Stygian Stones—which can be found deep within The Pit—these bosses cost more to summon but drop far more rewards. To summon a Tormented Echo, simply go to their typical summon location and select the Tormented Echo variant. Note that to summon the Beast in Ice, you’ll need to craft a different Nightmare Dungeon Sigil. All items dropped from Tormented Echoes will be Item Level 925. Defeating your first Tormented Echo drops one Resplendent Spark as a first-time reward (account bound). [h2]Fight with the Iron Wolves[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/510ef033cba9565e21f75e16621da64cd01ba66c.jpg[/img] Seek out the battle-hardened and stalwart Soudeh the Anvil, a stoic field commander of the Iron Wolves. The Iron Wolves are a band of noble Mercenaries in the South, seeking to protect the common people of Sanctuary and hold themselves to a higher code of honor than other mercenary companies of similar mettle. Mysteriously, members of their ranks have been dying under suspicious circumstances—seek out the source of this slaughter to earn the Iron Wolves’ favor. Meet Soudeh in Khejistan to start your journey to uncover this deadly plot. Working with the Iron Wolves will earn you several Tempering Manuals, which are key to unlocking the potential of your items in Season 4: Loot Reborn. Any Iron Wolf Events that occur in Helltide will persist past the end of Season 4: Loot Reborn. [h2]Earn Rewards with the Season Journey and Battle Pass[/h2] As you fight side by side to vanquish demons with the Iron Wolves, you’ll earn rewards from the Season Journey and Battle Pass. The Season Journey is broken into Chapters with tasks to complete. As you progress through the Journey, you’ll earn rewards befitting Sanctuary’s defenders, such as new Legendary Aspects, and 3 Scrolls of Amnesia, which provide a free Skill Tree and Paragon Board reset. The Journey also provides Favor—the resource used to climb through the Battle Pass’ Tiers— also earnable simply by playing aspects of the game. [img]{STEAM_CLAN_IMAGE}/44681402/e6fff462ce4b30be571987013c8f7ec8a17bba8c.png[/img] The [b]Season 4: Loot Reborn Battle Pass[/b] begins on [b]May 14, 10 a.m. PT[/b] and hosts 90 Reward Tiers (28 Free Tiers and 62 Premium Tiers). [img]{STEAM_CLAN_IMAGE}/44681402/626ce824fd1c57ed46214544e4772b1507390cb2.png[/img] If you get the Premium Battle Pass, not only will the rewards of the Free Tiers be yours to wield, but [b]Awoken Demigod Armor Sets[/b], Platinum, and more also await you, including the [b]Awoken Demigod Plating Mount Armor[/b], [b]Purified Demigod Thoroughbred Mount[/b], and [b]Divine Banner Mount Trophy[/b], which unlocks at [b]Tier 90[/b]. [img]{STEAM_CLAN_IMAGE}/44681402/95639c41d7e127592aacceae8da5201ed3215a86.jpg[/img] The Accelerated Seasonal Battle Pass also contains 20 Tier Skips and the Wings of Hell’s Legion Emote. Smoldering Ashes earned from the Free Tiers can be spent on Season Blessings that provide helpful bonuses to beat back Hell’s armies. There are three new Blessings for Season 4: Loot Reborn: [list] [*]Urn of Nightmares: Boost Paragon Glyph XP earned in Nightmare Dungeons.[/*] [*]Urn of Iron: Boost your reputation with the Iron Wolves from Helltide activities.[/*] [*]Urn of Burning Obols: Boost the amount of Obols you can find in Helltide chests, which contain Obols during this season.[/*][/list] The bonuses gained from the five Season Blessings only last until the end of Season 4: Loot Reborn. [h2]Acquire Fabled Threads from Tejal’s Shop[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/0a101cf82681ae82df84657270d6664c87c858a8.jpg[/img] We’re dialing up the heat in the Shop with new Equipment, Armor, Accessories, Mount and Mount Armor bundles that will have you slaying in style. Starting on May 14, pay Tejal a visit to browse her wares—remember to check back often, as she’ll update her stock throughout Season 4: Loot Reborn. One such rarefied find from the far reaches of Sanctuary is the the Demon’s Heart Bundle for the barbarian, which contains the Demonheart Armor Set and 2 Demonheart Weapon Cosmetics. [h2]Community Guides for Season 4[/h2] If you need sage guidance in your Character’s journey throughout Season 4: Loot Reborn, look to our Community guides for tips and insights on builds for every class. From levelling in World Tier I, all the way to end-game builds for The Pit. Visit our trusted Community resources here: [list] [*][url=https://maxroll.gg/]Maxroll[/url][/*] [*][url=https://www.icy-veins.com/]Icy Veins[/url][/*] [*][url=https://www.wowhead.com/diablo-4]Wowhead[/url][/*] [*][url=https://www.purediablo.com//]PureDiablo[/url][/*] [*][url=https://mobalytics.gg/diablo-4]Mobalytics[/url][/*][/list] Master the forge and flame to conquer emerging threats in Season 4: Loot Reborn! -The Diablo IV Team", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5510784213117127575", "title": "Diablo IV | Season of the Construct | Gameplay Trailer", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5510784213117127575", "date_utc": "2024-01-23T19:46:33+00:00", "contents": "[previewyoutube=2If1IGozhFY;full][/previewyoutube] Legends tell of ancient treasure deep in the heart of Sanctuary. Can you survive long enough to find it? Season of the Construct is live now in #DiabloIV.", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6300039510138860542", "title": "Season of the Construct Announcement Trailer", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6300039510138860542", "date_utc": "2024-01-16T19:13:22+00:00", "contents": "A new threat whirs to life in the depths of Sanctuary. Season of the Construct comes to Diablo IV on January 23rd. [previewyoutube=XAwd0TKRLNQ;full][/previewyoutube] [url=https://steamcommunity.com/games/2344520/announcements/detail/7252550832884428678]Learn more[/url]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6300039510138686364", "title": "Unearth a looming threat in Season of the Construct", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6300039510138686364", "date_utc": "2024-01-16T18:04:30+00:00", "contents": "Ancient forces threaten Sanctuary. Aided by your Seneschal Companion, hazard the many traps and devastating Constructs beneath the deserts of Kehjistan. Deep beneath the swirling sands, elemental forces are amassing for malicious whims of the demon Malphas. Only by descending far below the surface will you be able to cull this cursed threat from its root. Season of the Construct begins on [b]January 23 at 10 a.m. PST[/b]. Prepare to uncover the powerful secrets of Zoltun Kulle’s Loom with a new Dungeon type called [b]Vaults[/b], a seasonal robotic [b]Seneschal Companion[/b], and Weekly Leaderboards in [b]The Gauntlet[/b]. Several key quality-of-life features—including almost constant Helltide events—arrive to help aid your conquests while fighting in the Vaults. [h2]Unearth Zoltun Kulle’s Legacy in a New Questline[/h2] A new threat lurks deep beneath the sands of Kehjistan, where the Loom, an ancient technology—designed by Zoltun Kulle and Ayuzhan of Caldeum—has been usurped by the forces of evil. The Demon Malphas is responsible for twisting the Loom for his cruel whims. Zoltun’s former companion Ayuzhan leads you through the treacherous Vaults, desperate to stop the formidable Malphas and his deadly constructs from overtaking Sanctuary. [img]{STEAM_CLAN_IMAGE}/44681402/141d5a66781b300e8cbd63d1d9053a4dd609daaa.jpg[/img] Travel to the [b]Gatehall[/b], a town center underneath Kehjistan that serves as your base of operations in the fight against the Constructs. The Gatehall is your conduit to access the deadly Vaults— riddled with elemental Hazards and Constructs, these Vaults are the key to harnessing the true potential of the Loom. Travel to the Loom to stop the threat at its source and defeat Malphas in a new Boss fight. To play the Season of the Construct Seasonal Questline, you must create a new character on the Seasonal Realm and have completed the Main Campaign. Take advantage of the Skip Main Campaign feature once you’ve completed the prologue if you want to jump right in! [h2]Battle side by side with your Seneschal Companion[/h2] Wield the power of the Loom by acquiring your very own Seneschal Companion, which becomes available during the Seasonal Questline. In Zoltun’s vision the Seneschal compliments your adventures by engaging directly in the fight or aiding you dutifully on the sidelines. [img]{STEAM_CLAN_IMAGE}/44681402/b2a7a509fe2b76131e5da7155b8ab65678e24e85.jpg[/img] Using magical Governing and Tuning Stones recovered from the Vaults and elsewhere in Sanctuary, augment your Seneschal to best suit your targeted build for Season of the Construct. Governing Stones determine which attacks your Seneschal can perform, while Tuning Stones will augment those skills and provide greater utility. You can equip your Seneschal with 2 Governing Stones and 6 Tuning Stones, one Governing stone for each attack and three Tuning Stones to augment the ability. There are 12 Governing Stones and 27 different Tuning Stones of different rarities to seek out in the Vaults to unlock the full power of the Seneschal construct. [img]{STEAM_CLAN_IMAGE}/44681402/7a4df5561e16ba03631ea82c6985de56a0c20ecc.jpg[/img] Tuning and Governing Stones can be acquired in a few different ways. Complete Vaults to earn one random Tuning Stone and seek out [b]Wardwoven Chests[/b] to earn additional Tuning Stones-- both of which can be earned through various levels of the Season Journey. Both types also have a low chance to appear as drops when playing Vaults and Arcane Tremors. Defeating enemy Constructs within the Vaults will also grant Shattered Stone, which can be crafted into Governing and Tuning Stones at Jewelers found throughout Sanctuary. To unlock the full power of the Stones, you will need to increase their raw power by levelling them. Collect or craft duplicates of the same Stones, fuse them together to grant experience and eventually level up your currently held Stones. Increasing the level of these stones increases the potency and ability of these attacks. Increasing the level of your Tuning Stones can add additional projectiles or augment the damage type they perform. Once you’ve acquired your Seneschal, they’ll follow you everywhere in Sanctuary until Season of the Construct ends. Below is a full list of the Governing and Tuning Stones available for the Seneschal Companion: [b]Governing Stones:[/b] [list] [*]Autodefense: The Seneschal Construct activates an antimaterial field around itself shooting down enemy projectiles. Can not shoot down Boss or Player projectiles.[/*] [*]Bushwhack: Quickly ambush dealing damage to each target. May strike the same target multiple times.[/*] [*]Firefly: Deploy a small construct that lands on the target and explodes 3 times, dealing damage.[/*] [*]Focus Fire: The Seneschal Construct channels a ray of fire onto targets dealing damage to each over time.[/*] [*]Gyrate: The Seneschal Construct whirls its legs around quickly dealing damage to all surrounding enemies.[/*] [*]Impale: Perform a line attack to all enemies in front of the Seneschal Construct dealing damage.[/*] [*]Lightning Bolt: Launch a bolt of Lightning at the target dealing damage. Arcs to other targets dealing a portion of the original damage.[/*] [*]Protect: The Seneschal Construct materializes a protective Barrier on the player for a portion of their Maximum Life.[/*] [*]Reconstruct: The Seneschal Construct channels a reconstruction beam Healing the player for a portion of their Maximum Life over time.[/*] [*]Slash: Pummel enemies in front of the Seneschal Construct dealing damage.[/*] [*]Tempest: Electrically charge an enemy causing it to deal damage to themselves and additional each second over time. If the enemy is killed, Tempest spreads to another enemy gaining for additional time and bonus damage. These bonuses are also applied if Tempest is reapplied onto the same enemy.[/*][/list] [b]Tuning Stone Abilities:[/b] [list] [*]Voluminous Support: The supported skill's effect size is increased.[/*] [*]Swift Support: The supported Skill gains an Attack Speed bonus.[/*] [*]Breaking Support: Damage from the supported Skill instantly destroys enemy Barrier effects. In addition, there is a chance to make enemies Vulnerable for 2 seconds.[/*] [*]Tactical Support: Decrease the cooldown of the supported Skill.[/*] [*]Efficiency Support: When the supporting skill deals damage, you gain Critical Strike Chance to the same targets hit.[/*] [*]Devastation Support: Supported Skill gains a Critical Strike Damage bonus.[/*] [*]Safeguard Support: When used, the supported Skill grants Damage Reduction to you.[/*] [*]Frigid Support: A portion of the supported Skill's damage dealt is applied as Cold damage over time and applies Chill.[/*] [*]Burning Support: A portion of he supported Skill's damage is applied as Burning damage over time. Burning enemies take bonus Critical Strike Damage from the Seneschal Construct.[/*] [*]Electrocution Support: A portion of the supported skill's damage dealt is applied as Lightning damage over time and has a chance to Stun enemies.[/*] [*]Bleeding Support: A portion of the supported skill's damage dealt is applied as Bleeding damage over time. Enemies take bonus Bleeding damage from all sources while moving.[/*] [*]Poison Support: A portion of the supported skill's damage dealt is applied as Poison damage over time. This poison has a chance each second to spread all Poison damage to an additional enemy.[/*] [*]Dusk Support: A portion of the supported Skill's damage dealt is applied as Shadow damage over time. Afflicted enemies who attack have a chance for their attacks to be interrupted. Does not interrupt Bosses.[/*] [*]Duration Support: Supported Skills have their durations increased.[/*] [*]Fortify Support: When the Seneschal Construct uses the supported Skill, you gain Fortify. Skills with slower attack speeds or skills with cooldowns will increase the amount of Fortify granted.[/*] [*]Resource Support: Player gains an amount of Primary Resource when the supporting Skill first deals damage.[/*] [*]Initiative Support: The supported Skill will cause the Seneschal Construct to teleport to the target if out of range. Can only occur once every so often seconds.[/*] [*]Arcing Support: The supported Skill can hit additional enemies.[/*] [*]Multishot Support: Supported Projectile skills launch additional projectiles.[/*] [*]Piercing Support: The supported Projectile Skill will pierce multiple enemies.[/*] [*]Gripping Support: Damage and effects done by the supporting Skill to Distant enemies pulls them towards the Seneschal Construct. Can only occur once every so often per enemy.[/*] [*]Registered Damage Support: Any damage caused from the supported Skill is registered. The registered damage explodes at effectiveness when the target dies as Fire damage.[/*] [*]Seeking Support: The supported Projectile Skill will auto-seek enemies for a limited duration.[/*] [*]Slowing Support: Damage from the supported Skill Slows enemy movement speed for a limited duration. The closer the enemy is to the Seneschal Construct, the greater the Slow amount. Enemies may be slowed up to a maximum amount.[/*] [*]Mockery Support: Damage done by the supporting Skill Taunts enemies hit for a limited duration of time. This can only occur once every so often per enemy. Does not work on bosses.[/*][/list] Scholars have spoken in hushed whispers concerning rumors of fabled Tuning Stones, far beyond the capable power of mere mortals. Their existence is ephemeral, never confirmed by a dignified mage of high ranking. All that is known of them is writ below: [list] [*]Evernight: ???[/*] [*]Genesis: ???[/*][/list] [img]{STEAM_CLAN_IMAGE}/44681402/69287263040dc7ec0797638609bef331fa41d1c9.jpg[/img] [h2]Test yourself in Deadly New Dungeons: Vaults[/h2] While Ayuzhan slept, Malphas grew in strength, harnessing the awesome power of the Loom and corrupting the vast network of Vaults lying dormant. Originally armed to keep out any demonic influence, the various Hazards implemented now protect the forces of evil they once kept at bay. [img]{STEAM_CLAN_IMAGE}/44681402/067f185f9a29cb7edcacb51820cc33de9dc5bacb.jpg[/img] The Vaults are specialized dungeons that house elemental Hazards devised by Zoltun Kulle and Ayuzhan themselves. Amongst the Hazards lay The Constructs, an entirely new monster family. Several elemental variants of these monsters lurk in wait for any unsuspecting wanderers to fall into their mechanical clutches. [img]{STEAM_CLAN_IMAGE}/44681402/04a4ce09ed8655a820c1b6d1d94229f2853b9f06.jpg[/img] Upon entering the Vault—after converting the required Pearls of Warding— you can be blessed by [b]Zoltun’s Warding[/b], a special layered blessing which grants access to riches within the Vaults. Zoltun’s Warding diminishes stack by stack if you manage to fall prey to the various Hazards scattered throughout the Vaults. If you manage to keep Zoltun’s Warding intact after defeating the Vault Boss, you’ll unlock a [b]Wardwoven Chest[/b], which has a higher chance of granting Legendary items. Using [b]Pearls of Warding[/b] can increase the risk by exchanging them for extra stacks of Zoltun’s Warding at the Vault entrance—succeed, and your reward will increase as well. At World Tier III, [b]Nightmare Vaults[/b] unlock. Vault Sigils will drop alongside typical Nightmare Dungeon Sigils, or they can be crafted which will require Pearls of Warding to create. These Vaults function similar to Nightmare Dungeons—however they will have deadly Constructs and Hazards scattered throughout, and the Wardwoven Chests for the savvy wanderer. [h2]Staunch the Spread of Arcane Tremors[/h2] Malphas’ seeks to unleash deadly Constructs upon Sanctuary, pouring from the underground Vault to terrorize the innocents and sinful alike. Dismantle deadly traps, destroy Lesser and Elite Constructs to earn Shattered Stone. Dispatching Elite Constructs grants Pearls of Warding which can be used to earn higher valued rewards from replaying Vaults. Negate the Arcane Tremor by defeating the Vault’s mighty Herald Construct, securing a tenuous peace to the denizens above. [h2]Coming Soon: Leaderboards Arrive with The Gauntlet[/h2] A new challenge arrives later in Season of the Construct. Fight through [b]The Gauntlet[/b], a weekly rotating fixed dungeon that will have you competing for the top spot on the leaderboards. Only the strongest will emerge to claim their place on the weekly leaderboards, the top weekly scores will earn their permanent place in the Hall of the Ancients. More details on the arrival of the Gauntlet will be available in a future blog. [img]{STEAM_CLAN_IMAGE}/44681402/23cf3b0bcd01e0c694fe7b8cf9b5e5b54826fa14.jpg[/img] [h2]Quality-of-Life Updates in Season of the Construct[/h2] [b]Helltides Endure[/b] Starting in Season of the Construct, Helltides are always active, save for a 5-minute rest once per hour. Battle Hellspawn far more frequently, increasing your chances to collect Cinders and the bountiful rewards that come with them. [b]Enhanced Movement with W-A-S-D[/b] Wanderers on PC can now navigate through the various wastes of Sanctuary by using the W-A-S-D keys on your keyboard, instead of your mouse. Enjoy the increased functionality of traversing through dungeons and above ground alike. [b]Extra Stash Tab[/b] An extra Stash Tab is now available for your adventuring needs. Proceed to the Stash in any capital city to purchase an additional stash tab. [b]Various other Quality-of-Life Updates[/b] We have also made improvements to reallocating your skill tree, improvements to UI when trading Gold, increased rates to earn the items needed to summon the Beast in the Ice, and more! [img]{STEAM_CLAN_IMAGE}/44681402/beb034f249dbd27ff2b62a4f76db68eeb80e55c7.jpg[/img] Stay tuned for our [url=https://news.blizzard.com/diablo4/23964909/]full Patch Notes for Season of the Construct[/url], which will be available on [b]January 19[/b]. [h2]Earn Rewards with the Season Journey and Battle Pass[/h2] As you eradicate the menacing machinations of the Loom, you’ll earn rewards from the Season Journey and Battle Pass. The Season Journey is broken into Chapters with tasks to complete. As you progress through the Journey, you’ll earn rewards befitting Sanctuary’s defenders, such as new Legendary Aspects, the [b]Awoken Adamant Armor[/b] (which unlocks across various higher Tiers), and 3 Scrolls of Amnesia, which provide a free Skill Tree and Paragon Board reset. The Journey also provides Favor—the resource used to climb through the Battle Pass’ Tiers—which can be earned naturally by playing aspects of the game as well. [img]{STEAM_CLAN_IMAGE}/44681402/cbc6770418b6ffba6f0f74587ead7c85c2434177.jpg[/img] The [b]Season of the Construct Battle Pass[/b] begins on [b]January 23, 10 a.m. PST[/b] and hosts 90 Reward Tiers—28 Free Tiers and 62 Premium Tiers. [img]{STEAM_CLAN_IMAGE}/44681402/8328de96a126515cedaf1e9b48f33102456d22dc.jpg[/img] If you get the Premium Battle Pass, not only will the rewards of the Free Tiers be yours to wield, but [b]Awoken Armor Sets[/b], Platinum, and more also await you. For example, the [b]Awoken Spheral Barding Mount Armor[/b] and [b]Awoken Clockwork Equid Mount[/b] unlock at [b]Tier 90[/b]. [img]{STEAM_CLAN_IMAGE}/44681402/3b6cdbe1f5b4f87cd75865c78761b6b6a414e345.png[/img] If you decide to embrace the destructive terror and get the Accelerated Seasonal Battle Pass, you’ll also receive 20 Tier Skips and the Spinning Loom Emote. Smoldering Ashes earned from the Free Tiers can be spent on Season Blessings that provide helpful bonuses to beat back Hell’s armies. There are three new Blessings for Season of the Construct: [list] [*]Urn of Enduring Grace: Boost to the duration of Shrine effects.[/*] [*]Urn of Tuning: Chance to receive an additional Tuning Stone from Wardwoven chests.[/*] [*]Urn of Whispers: Boost the chance to receive a Greater Collection from Whisper rewards.[/*][/list] The bonuses gained from the five Season Blessings only last until the end of Season of the Construct. [h2]Acquire Fabled Threads from Tejal’s Shop[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/7db0574b9ba87098c9f35a6b68f31ecc77f49b15.jpg[/img] We’re dialing up the heat in the Shop with new Equipment, Armor, Accessories, Mount and Mount Armor bundles that will have you slaying in style. Starting on [b]January 23[/b], you’ll want to pay Tejal a visit to browse her wares—remember to check back often, as she’ll update her stock throughout Season of the Construct. One such rarefied find from the far reaches of Sanctuary is the barbarian Lord Eater Cosmetic Bundle, which contains the [b]Lord Eater‘s Armor Set[/b], [b]2 Lord Eater’s Weapon Cosmetics[/b], and a [b]Lord Eater’s Legend[/b] marking. [h2]Stay Up to Date with Diablo IV News[/h2] On [b]January 18 at 9 a.m. PST[/b], there will be a Developer Update Livestream, which will take a deep dive into everything coming with Season of the Construct. Join community director Adam Fletcher and members of the Development team as they discuss the all-new Seneschal companion, Vaults, the Seasonal Questline, and more. Watch the Diablo IV Developer Update Livestream on our [url=https://www.twitch.tv/diablo]Twitch[/url] or [url=https://www.youtube.com/Diablo]YouTube[/url] Channels on [b]January 18[/b]. Fight back the devilish machinations that threaten all we hold dear in Season of the Construct! -The Diablo IV Team", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5395938616788903471", "title": "Diablo IV Patch Notes: 1.2.2b Build #47240", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5395938616788903471", "date_utc": "2023-12-06T00:45:20+00:00", "contents": "[b]1.2.3 Build #47693[/b] December 5, 2023[h2]Gameplay Updates[/h2][list] [*]Starting on December 5, battle legions of Zir’s minions and race against time in a new endgame pinnacle dungeon, Abattoir of Zir. For more information, visit [url=https://news.blizzard.com//diablo4/24030418/?blzcmp=blizzard-news]this article[/url].[/*] [*]A full list of possible affixes can now be previewed in the Enchantment menu using the new View Possible Affixes button.[/*] [*]Earned Glyph experience from most Nightmare Tiers was increased. [list] [*]Tiers 1-17: No Change.[/*] [*]By Tiers 30: From 66 to 79.[/*] [*]By Tier 50: From 106 to 139.[/*] [*]By Tier 75: From 156 to 239.[/*] [*]By Tier 100: From 206 to 339.[/*] [/list] [/*][/list] [b]Developer’s Note: [/b]After reviewing gameplay data and player feedback, we recognized that completing higher Nightmare Tiers was not as rewarding as we initially hoped for, with many players stopping their journey after reaching Tier 50. The experience increase to Glyphs at higher Tiers was made with the intent of incentivizing players to push their builds, making their arrival at Tier 100 feel that much more fulfilling. We will monitor how this change in experience pans out for players and encourage you to provide us with any feedback you have around this system. [list] [*]Introduced further support for NVIDIA Reflex technology. Visit the in-game settings to enable this feature.[/*][/list][h2]Bug Fixes[/h2][h3]Accessibility[/h3][list] [*]Fixed an issue where the Screen Reader didn’t announce the required pacts for Vampiric Powers.[/*] [*]Fixed an issue that made the Screen Reader malfunction on the Steam Deck.[/*][/list][h3]Dungeons[/h3][list] [*]Fixed an issue where the Mechanical Box wouldn't respawn if the player was killed by the boss in the Bastion of Faith.[/*] [*]Fixed an issue in the Fallen Temple dungeon where the objective to destroy the Idol of the Fallen Temple could not be completed properly if the Idol was destroyed instantly.[/*] [*]Fixed an issue where the debuff effects in the Fallen Temple could be avoided when leaving and re-entering the Dungeon.[/*] [*]Fixed an issue where enemies from the Sole Survivor event could spawn behind locked doors in the Hallowed Ossuary, blocking event mastery completion.[/*] [*]Fixed an issue where Nightmare Dungeons wouldn't properly reset after all revives were exhausted when playing local co-op.[/*] [*]Fixed an issue where enemies spawned by Animus-carrying monsters with the Summoner affix unexpectedly carried Animus.[/*] [*]Fixed an issue where bonus Elemental Damage affixes of Nightmare Dungeons scaled their damage too low or too high for their respective Tier.[/*][/list][h3]Gameplay[/h3][list] [*]Fixed an issue where some attacks made by Echo of Lilith would not properly trigger if the player in the Party that started the encounter died.[/*] [*]Fixed an issue where the first Death from Above cast by Echo of Lilith had irregular timing and didn't display an incoming projectile indicator.[/*] [*]Fixed an issue where Frostburn and Mother's Embrace could drop as Sacred and not Ancestral from Tormented Echo of Varshan in World Tier IV.[/*] [*]Fixed an issue where Gems could still drop from some sources, such as Avarice's chest or Whisper Caches, instead of Gem Fragments.[/*] [*]Fixed an issue where Rabies cast by Werewolf companions from the Of the Alpha legendary aspect could miss.[/*] [*]Fixed an issue where Druids could continuously run into a wall if Trample was used to move towards a nearby wall.[/*] [*]Fixed an issue where Treasure Goblins would sometimes become invincible and run away if the player mounted or unmounted near them. (Treasure Goblins have had enough of your bullying, wanderer.)[/*][/list][h3]Season of Blood[/h3][list] [*]Fixed an issue where Blood Harvesters could quickly disappear after spawning.[/*] [*]Fixed an issue where the Norvaic enemy could spawn repeatedly in certain co-op situations.[/*] [*]Fixed an issue where Seeds of Hatred extracted by being Hatred's Chosen did not count towards a Season Journey objective’s progress.[/*] [*]Fixed an issue which made Potent Blood dropped from a Blood Well inaccessible.[/*][/list] [b]Developer’s Note: [/b]A previous Hotfix allowed players to walk through Blood Wells to access Potent Blood. This change reverts the ability to walk through Blood Wells, but in exchange, Potent Blood will no longer spawn in the middle of Blood Wells so it can be easily picked up. [list] [*]Fixed an issue where Duriel wouldn’t spawn when the player re-entered the boss arena after respawning.[/*][/list][h3]User Interface and User Experience[/h3][list] [*]Fixed an issue where map overlays for Helltide and Blood Harvest wouldn't display properly when entering a region covered by fog of war.[/*] [*]Fixed an issue where the tooltip displayed while hovering over certain items could blink periodically.[/*] [*]Fixed an issue where the text describing how to unlock Mounts was inaccurate for players who skipped the Campaign.[/*][/list] [b]Developer’s Note: [/b]If they choose to play through the Campaign, players that haven't yet unlocked Mounts must complete the Donan's Favor quest to unlock them. If the campaign is skipped, you must reach Level 25 before unlocking Mounts. The tooltip previously mentioned Quest completion only, which is irrelevant when skipping the Campaign. [list] [*]Fixed an issue where navigating to the Season Journey from a Seasonal Aspect wouldn't open the correct chapter.[/*] [*]Navigating the Seasonal Stash with a controller will now be more consistent.[/*][/list][h3]Miscellaneous[/h3][list] [*]Fixed an issue where visual effects on armor would remain fully visible while using Concealment. (Lilith sees all, foolish wanderer.)[/*] [*]Various visual, performance, and stability improvements.[/*][/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6560117310264940302", "title": "Diablo IV Patch Notes: 1.2.2b Build #47240", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6560117310264940302", "date_utc": "2023-11-16T18:23:03+00:00", "contents": "[b]1.2.2b Build #47240 (PC)[/b][i] - November 15, 2023[/i] [list] [*]Fixed an issue where Virtual Currency values wouldn’t automatically update when purchased in-game by Steam players.[/*] [/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5302486387995302486", "title": "Diablo IV Patch Notes: 1.2.2a Build #47002", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5302486387995302486", "date_utc": "2023-11-08T18:53:54+00:00", "contents": "[b]1.2.2a Build #47002 (All Platforms)[/b][i] - November 8, 2023[/i] [list] [*]Fixed an issue where the game could crash when viewing a seasonal stash.[/*] [/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5288974951225515255", "title": "Diablo IV Patch Notes: 1.2.2 Build #46837", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5288974951225515255", "date_utc": "2023-11-07T18:15:18+00:00", "contents": "[b]1.2.2 Build #46837 (All Platforms)[/b] - November 7, 2023 [h2]Gameplay Updates[/h2] [h3]Malignant Rings[/h3] Five new Unique Rings have been added to the game, one for each class. These are based on popular Malignant Powers from Season of the Malignant, and are immediately available in both Seasonal and Eternal realms. [list] [*]Ring of Red Furor (Barbarian Unique Ring) [list] [*]After spending 100 Fury within 3 seconds, your next cast of Hammer of the Ancients, Upheaval, or Death Blow is a guaranteed Critical Strike and deals 10—30% (multiplicative damage) [x] bonus Critical Strike Damage.[/*] [/list] [/*] [*]Tal Rasha's Iridescent Loop (Sorcerer Unique Ring) [list] [*]For each type of Elemental damage you deal, gain 10—15%[x] increased damage for 4 seconds. Dealing Elemental damage refreshes all bonuses.[/*] [/list] [/*] [*]Airidah's Inexorable Will (Druid Unique Ring) [list] [*]When casting an Ultimate Skill and again 5 seconds after, Pull in Distant enemies and deal 0.5-1.0 Physical damage to them. This damage is increased by 1%[x] per 1 point of Willpower you have.[/*] [/list] [/*] [*]Writhing Band of Trickery (Rogue Unique Ring) [list] [*]Casting a Subterfuge Skill leaves behind a Decoy Trap that continuously Taunts and lures enemies. The Decoy Trap explodes after 3 seconds dealing 2.0-3.0 Shadow damage. Can occur every 12 seconds.[/*] [/list] [/*] [*]Ring of the Sacrilegious Soul (Necromancer Unique Ring) [list] [*]Automatically activate the following equipped Skills on Corpses around you: [list] [*]Raise Skeleton every 1-2 seconds.[/*] [*]Corpse Explosion every 1-2 seconds.[/*] [*]Corpse Tendrils every 8-16 seconds.[/*] [/list] [/*] [/list] [/*] [/list] [b]Developer’s Note: [/b]Creating the Malignant Rings are a way for us to take popular Seasonal content that resonated with Players and reintroduce it in a way that can persist beyond the Season and into the Eternal realm. [h3]Season of Blood[/h3] The following adjustments have been made for the Sanguine Battery Event. [list] [*]Pillar health has been increased from 75% to 85%.[/*] [*]Pillar repair time has been decreased from 3 seconds to 1 second.[/*] [/list] [h2]Bug Fixes[/h2] [h3]Season of Blood[/h3] [list] [*]Fixed an issue where the additional enemies in the Lord Zir boss fight would not get stunned when Lord Zir gets staggered.[/*] [*]Fixed an issue where Metamorphosis would not trigger temporary movement speed bonuses.[/*] [*]Fixed an issue where the Anticipation Vampiric Power didn't display Cooldown Reduction for Ultimate abilities when in town.[/*] [*]Fixed an issue where the Hectic Vampiric Power did not reduce the cooldown of skills with charges.[/*] [*]Fixed an issue where the seasonal quest “Battle of Fear” and “Faith” could be completed without completing Chapter 3 of the Season Journey.[/*] [*]Fixed an issue where the upgrade button for Vampiric Powers could be interacted with when there are no new powers available, wasting 25 Potent Blood.[/*] [*]Fixed an issue where Lord Zir could not respawn if the player re-entered the boss arena too quickly after respawning.[/*] [*]Fixed an issue where Evade and non-damaging Skills could trigger Hemomancy.[/*] [/list] [h3]Dungeons and Events[/h3] [list] [*]Fixed an issue where progression would be blocked when an enemy spawned behind the locked door in the Luban's Rest dungeon.[/*] [*]Fixed an issue where monsters could spawn from a Nightmare Portal location after the portal had teleported or been destroyed.[/*] [/list] [h3]Quests[/h3] [list] [*]Fixed multiple instances where the quest marker could disappear when leaving the area during multiple quests.[/*] [*]Fixed an issue where Prava and her knights could stop progressing through the area during the Scouring of Caldeum if certain Elites were killed from a distance during the “Kill Demons Attacking from Above” quest.[/*] [/list] [h3]Gameplay [/h3][list] [*]Fixed an issue where Lilith could still launch area-of-effect attacks after she is defeated following the first phase in the Echo of Lilith.[/*] [*]Fixed an issue where Angelbreath or Potions could randomly spawn when The Beast in the Ice spawned.[/*] [*]Fixed an issue where followers could get stuck when going back and forth over a traversal.[/*] [*]Fixed an issue where Inner Sight didn't trigger properly against Training Dummies.[/*] [*]Fixed an issue where Necromancer Minions and Druid Companions wouldn't attack Training Dummies.[/*] [/list] [h3]Accessibility [/h3][list] [*]Fixed an issue where the Screen Reader wouldn't properly read life totals above 999.[/*] [*]Fixed an issue where the Screen Reader on PS4 didn't read all the text in Vendor and Crafting displays.[/*] [/list] [h3]Miscellaneous [/h3][list] [*]Fixed an issue where achievements related to the Hatred's Chosen buff could not trigger appropriately.[/*] [*]Various visual, performance, and stability improvements.[/*] [/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5229301621580318284", "title": "Diablo IV Patch Notes: 1.2.1 Build #46666", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621580318284", "date_utc": "2023-10-27T17:01:14+00:00", "contents": "[h1][b]1.2.1 Build #46666 (All Platforms)[/b] - October 31, 2023[/h1] [h2]Gameplay Updates[/h2] Paragon Board [list] [*]Added a Refund All button to Paragon Boards.[/*] [/list] [b]Developer’s Note: [/b][u]Players communicated that reworking all or most of their Paragon Points was a common occurrence. We've added this button to make it easier to do big respecs, along with the increases to Gold income from Whispers in Season of Blood. [h3]Training Dummy[/h3] Players can test their mettle against a new inanimate and un-killable foe—the Training Dummy! The dummy is located in an underground room, the entrance can be found in Kyovashad. The training room contains a stash and the Training Dummy. Players can choose between attacking one Training Dummy or a small group of them, and dictate whether each Training Dummy is of Normal, Elite, or Boss monster difficulty. [h3]Season of Blood[/h3] [list] [*]Blood Wells now drop more piles of potent blood, slightly increasing the total average amount dropped. [list] [*]Previous: 1 pile of 45-60 Potent blood[/*] [*]New: 8 piles of 5-9 each[/*] [/list] [/*] [*]Added additional information to Vampiric Power tooltips to clarify what their next Rank will increase.[/*] [*]Added additional information to the Vampiric Powers upgrade screen that communicates the amount of Pacts required and the power’s activation cost.[/*] [/list] [h3]Miscellaneous[/h3] [list] [*]The search area has been reduced for all Whispers that require the player to find and kill a specific monster.[/*] [/list] [h2]Bug Fixes[/h2] [h3]Accessibility[/h3] [list] [*]Fixed an issue where the Screen Writer wouldn't fully read the Hunter's Acclaim title.[/*] [/list] [h3]Dungeons and Events[/h3] [list] [*]Fixed an issue where progress in the Halls of the Damned dungeon could be reset from leaving the area during the Travel to the Sepulchrum objective.[/*] [*]Fixed an issue with the Whispering Pines dungeon where doors could randomly appear in areas they shouldn't. (What lies behind door number 3? HELL!)[/*] [*]Fixed an issue where the Waves of Darkness event sometimes didn’t reward grim favors.[/*] [/list] [b]Gameplay [/b][list] [*]Fixed an issue where Shrine Buffs would not apply when activated while mounted.[/*] [*]Fixed an issue where Varshan could stop attacking if his path to the center of the arena was obstructed.[/*] [*]Fixed an issue where Temerity would only apply its Overheal barrier at full health instead of including excess healing when a source of healing would take the player beyond full Life.[/*] [*]Fixed an issue where monsters spawned by Hell Portals in a Nightmare Dungeon didn't properly scale their Life to the number of party members.[/*] [*]Fixed an issue where Aridah could become indefinitely idle if staggered within a particular window.[/*] [*]Fixed an issue where the Sorcerer's Ice Shards skill could miss short targets when cast from an area of higher elevation.[/*] [*]Fixed an issue where the player could avoid area of effect (AOE) damage while fighting The Beast in the Ice by standing in a particular area of the arena.[/*] [*]Fixed an issue where Aspect of Artful Initiative would not proc the damage reduction from the Explosive paragon glyph.[/*] [*]Fixed an issue where Aspect of Artful Initiative was not properly scaling with Item Power.[/*] [*]Fixed an issue where players were unable to revive their party members while under the effects of Chill.[/*] [/list] [h3]Quests[/h3] [list] [*]Fixed an issue where progression could be blocked during The Blind Eye quest if destructible terrain was broken from a distance during the Find a Way Out step.[/*] [*]Fixed an issue where scorpions would not spawn during the Final Straw quest if the Quest was abandoned and restarted.[/*] [*]Fixed an issue where some NPCs in Jirandai would disappear if Helltide was active in the area, blocking the ability to turn in certain Quests that had associated NPCs in the town.[/*] [*]Fixed an issue where Theya could keep respawning without dropping the item for the Sight to Madness quest, which could block progression.[/*] [*]Fixed an issue where Druid players could have progression blocked on their Class Quest if they attempted the Investigate Fainne step while other players were killing monsters in the same area.[/*] [/list] [h3]Season of Blood[/h3] [list] [*]Fixed an issue where Blood Lure Receptacles could be activated without getting rewards in Local Co-Op play.[/*] [*]Fixed an issue where the Sanguine Pillar in the Sanguine Battery event didn't have its life scale properly in Nightmare Dungeons, making it very easy for enemies to destroy.[/*] [*]Fixed an issue where Vampiric Curse could be applied to non-hostile objects.[/*] [*]Fixed an issue where Seeker Caches could drop more than once when a player swapped between different parties.[/*] [*]Fixed an issue where the Blood Seal menu couldn't be navigated properly with the D-Pad on controllers while inspecting equipped blood seals.[/*] [*]Fixed an issue where Evade and non-damaging Skills could trigger Hemomancy.[/*] [*]Fixed an issue where swapping between keyboard and controller while upgrading Vampiric Powers would consume Potent Blood without applying the upgrade.[/*] [*]Fixed an issue where removing a Pact while in the Vampiric Powers tab would cause equipment tooltips to malfunction.[/*] [*]Fixed an issue where the tooltip implied that Durability would be restored to a damaged item after removing a Pact from it.[/*] [*]Fixed an issue where the player could get stuck behind a Seeker's Cache in Hawezar during the Blood Harvest event.[/*] [*]Fixed an issue where the Glacial Fissure attack from the Beast in the ice could deal damage through walls and outside of the boss area.[/*] [*]Fixed an issue where the Summons of the Deathless quest could have its progression blocked if not all players in the party were alive when starting the Speak to Erys step.[/*] [*]Fixed an issue where the Magistrate's Notice could be inaccessible during the Blood Money quest if another player in the party didn't have the Quest active.[/*] [*]Fixed an issue where Flickerstep's affix would occasionally not activate when using Metamorphosis.[/*] [*]Fixed an issue where the description of the Domination vampiric power described the effects of Chill when it should have described the effects of Frozen.[/*] [*]Fixed an issue where the Blood Bishop's Flesh Sacks were not properly damaging players.[/*] [*]Fixed an issue where Stored Souls could get spent by the Sorcerer’s defensive auto-cast Skills such as Ice Armor and Frost Nova.[/*] [*]Fixed an issue where using the Metamorphosis Blood Seal while having Oculus equipped would result in Teleport evade charges not renewing properly.[/*] [*]Fixed an issue where exiting the Blood Seal upgrade screen too quickly could result in being unable to upgrade the Blood Seal again until you restarted the game.[/*] [*]Fixed an issue where Scroll of Amnesia would not go to the Lost Stash if left on the ground and the player left the area.[/*] [*]Fixed an issue where the Sack of Vampiric Torques would drop rings instead of amulets.[/*] [/list] [h3]User Interface and User Experience[/h3] [list] [*]Fixed an issue where Several towns were missing a Stash icon in their waypoint tooltip on the Map.[/*] [*]Fixed an issue where Achievement progression percentage was not consistent in all places it is displayed.[/*] [*]Fixed an issue where Inventory sorting didn't function properly while interacting with vendors or crafters.[/*] [*]Fixed an issue where killing a monster with Metamorphosis didn't reward a soul stack.[/*] [*]Fixed an issue where the new item indicator would persist on the Quest tab after the item was used or turned in.[/*] [*]Fixed an issue where the tooltip for Damage Reduction on armor could be inaccurate at higher armor levels.[/*] [*]Fixed an issue where Social Wheel actions (emotes, trade, etc.) would not work properly while in the Immunity bubble at the end of a Nightmare Dungeon.[/*] [*]Fixed an issue where the Social Wheel customization tab wouldn't function properly when multiple players in Local Co-Op attempted to use it simultaneously.[/*] [*]Fixed an issue where the tooltips for Aspect of Untimely Death and Berserking displayed their bonuses as additive instead of multiplicative.[/*] [*]Fixed an issue where the completion pop-up for the Missing Pieces quest displayed an incorrect image.[/*] [*]Fixed an issue in the Codex of Power menu where the Seasonal Realm filter could be active in Eternal Realm games.[/*] [*]Fixed an issue where the tooltip for Aspect of Raw Might didn't display its multiplicative damage indicator.[/*] [*]Fixed an issue where the tooltip for Aspect of Elements had no damage type indicator on its tooltip and was incorrectly granting an additive bonus instead of multiplicative.[/*] [*]Fixed an issue where Enhanced Fireball's tooltip stated that its benefit was dependent on distance traveled.[/*] [*]Fixed an issue where the Campfire Buff description was displaying the incorrect experience percentage bonus (Note: Bonus experience players have been receiving was already functioning correctly).[/*] [/list] [h3]Miscellaneous [/h3][list] [*]Fixed an issue where using a Chaos Scroll while exiting the Fields of Hatred could disconnect the camera from the player.[/*] [*]Fixed an issue where Reins of the Bloody Liquid Steed Mount Cosmetic was not rewarded for defeating Echo of Lilith.[/*] [/list] [b]Developer’s Note: [/b]This will be rewarded retroactively for any players that have already defeated Echo of Lilith. These players will receive the Mount upon logging in after installing Patch 1.2.1. [list] [*]Fixed an issue where Cinders would not be reset once a Helltide ended.[/*] [*]Fixed an issue where the Cinder cost of the Tortured Gift of Living Steel was 280 instead of the displayed 300. It now costs 300 Cinders.[/*] [*]Fixed an issue where riding a Mount that had no armor would cause the player character to appear as carrying invisible reins.[/*] [*]Fixed an issue where the dagger option was not available at the Purveyor of Curiosities for Sorcerers.[/*] [*]Fixed an issue where Uber Unique items were not always dropping at their maximum roll values.[/*] [*]Various performance, stability, and visual improvements.[/*] [/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5229301621570664891", "title": "Diablo IV Patch Notes: 1.2.0d", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5229301621570664891", "date_utc": "2023-10-25T01:28:24+00:00", "contents": "[b]1.2.0d Build #46536 (All Platforms) - October 24, 2023[/b] [list] [*] Fixed an issue that prevented players from redeeming their Accelerated Seasonal Battle Pass after upgrading to the Ultimate Edition of Diablo IV. [/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5218041989047375115", "title": "Diablo IV Patch Notes: 1.2.0a and 1.2.0b", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5218041989047375115", "date_utc": "2023-10-20T18:19:11+00:00", "contents": "The Diablo IV team has been diligently monitoring your feedback. As we introduce patches to keep your experience in Sanctuary smooth, we will update the below list and denote whether the fixes are intended for PC, Xbox, PlayStation, or all platforms. [h3]1.2.0a Build #46321 (All Platforms) - October 18, 2023[/h3] [b]Bug Fixes[/b] [list] [*] Fixed an issue with cross-platform play that prevented players on PC and console from playing together. [*] Various Improvements to stability. [/list] [h3]1.2.0b Build #46384 (All Platforms) - October 20, 2023[/h3] [b]Bug Fixes[/b] [list] [*] Fixed an issue where bonus items from the Blizzcon Collection were granted early and displayed placeholder content [*] Fixed an issue where the Season of Blood Battle Pass only rewarded a total of 666 Platinum instead of the intended 700 Platinum. [*] Fixed an issue where the Real ID name of players was displayed locally in the Clan menu by default. [*] Various stability improvements. [/list]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6438516944139687428", "title": "Season of Blood is now live!", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6438516944139687428", "date_utc": "2023-10-17T19:28:57+00:00", "contents": "Dare to look fanged destruction in the face and send it back to Hell with a new Season Journey, Questline, Season Event, deadly blood-driven enemies, Battle Pass, and more. [previewyoutube=-e7ft6Ye-tA;full][/previewyoutube]", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "6438516944136281774", "title": "Diablo IV Patch Notes", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6438516944136281774", "date_utc": "2023-10-16T21:03:44+00:00", "contents": "The [i]Diablo IV[/i] team has been diligently monitoring your feedback. As we introduce patches to keep your experience in Sanctuary smooth, we will update the below list and denote whether the fixes are intended for PC, Xbox, PlayStation, or all platforms. Patch 1.2.0 goes live on October 17—[url=https://news.blizzard.com/diablo4/23964909][b]visit this article[/b][/url] to read the full notes.", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5220292521178168751", "title": "Bite down on darkness in Season of Blood", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5220292521178168751", "date_utc": "2023-10-04T20:49:49+00:00", "contents": "Stepping out from the shadows that once obscured them, the Dark Master’s Blood Seekers swoop in to prey upon unsuspecting mortals. Their ravenous appetites have grown—the [b]Season of Blood[/b] will soon ooze throughout Sanctuary! Diablo IV’s second season begins on [b]October 17 at 10 a.m. PDT[/b]. Dare to look fanged destruction in the face and send it back to Hell with a new Season Journey, Questline, Season Event, deadly blood-driven enemies, Battle Pass, and more. Plus, new Uber Endgame bosses have arrived in Sanctuary to increase the variety of endgame activities in Diablo IV. These havoc-wreaking bosses are hard to topple but can drop Unique items and Cosmetics found nowhere else. We’re shedding light on all the grisly details—read on for a comprehensive look at Season of Blood’s contents. Beginning with Season of Blood, players will now have the option to skip the Campaign after completing the Missing Pieces quest from the Prologue on the Seasonal Realm. Choosing to do so will allow you to jump right into content from Season of Blood. [b]Patch 1.2.0 goes live on October 17[/b] too! Visit [url=https://news.blizzard.com/diablo4/23964909/]this article[/url] on October 10 after our upcoming Diablo IV Campfire Chat for more information on Class balance, new Unique items, sweeping changes to Resistances, and a great deal of other quality of life updates and bug fixes. [h2]Turn Back Crimson Tides with Erys in a New Quest[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/7697dbda5c6286e6067ad1bce3cc7edf49bf6ba3.jpg[/img] At first, they targeted small hamlets, descending upon insignificant prey and tearing into their jugular—a most grisly death to befall someone. But then their ambitions grew, and they became sloppy, greedy. That’s when word of suspicious vampire activity met your ears, wanderer. Magistrate Oren, the distraught leader of a town badly plagued by these bloodthirsty assailants, needs your help in investigating the recent slew of murders. Enter Sanctuary’s vampire-infested underbelly in a new Questline, recruit the skillful vampire hunter Erys to your cause, and discover the sinister plot of the Dark Master behind it all. [img]{STEAM_CLAN_IMAGE}/44681402/4d4b7755c0a89ea10c1aca4fc5ca189d52f9ce22.jpg[/img] Your monstrous new adversaries are not a typical demonic disturbance and require you to harness their [b]Vampiric Powers[/b] with the aid of new Pact Armor. You must unleash your newfound power on its originators in a most ruthless display to put them to rest. Only then may Sanctuary be truly [i]safe[/i] for a spell. Embark on this new Questline by heading over to Ked Bardu. Speak to Oren and he will set you off on the [i]Blood Money[/i] quest. [h2]Siphon the Blood of Your Foes Using Vampiric Powers[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/a6c20f095a7fea4b0210a241c90998e961191832.jpg[/img] Driving a stake into the heart of the Dark Master’s plan will require you to wield their same savagery—Vampiric Powers. What was once a forbidden art shall become Sanctuary’s salvation. But to wield it, you’re going to need blood, Potent Blood. Acquired from fallen adversaries, Potent Blood can be spent in the Vampiric Powers tab within the Character menu to unlock a random power or power upgrade. Vampiric Powers can also be unlocked by completing the Seasonal Questline and from the Blood Harvest Seasonal Event. We’ll cover the latter in detail later. [img]{STEAM_CLAN_IMAGE}/44681402/a6f539130f1f79207c30d3d4a27192ebb78b18cb.jpg[/img] After learning a Vampiric Power, you can spend Potent Blood in the powers tab to take its might to the next Level. Each power can be upgraded to a maximum of Level 3 and up to five powers can be equipped to your character at a time. When you hover over a Vampiric Power, you’ll notice it displays anywhere between 1–3 symbols and numbers—these are called Pacts and the number is their associated cost. This is where Pact Armor comes into play. [h3]Unpack Your Vampire Power Through Pact Armor[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/524994add887b024c8c354380a931800072f2b54.jpg[/img] There are three Pact types in total. Using the above image for reference, from left to right, they are called [b]Ferocity, Divinity, and Eternity[/b]. Keep your eyes peeled for Chest armor, Pants, Gloves, Boots, and Helms containing Pacts that drop during Season of Blood because they are needed to activate your Vampiric Powers. Once you have both Pact Armor and Vampiric Powers equipped, you’ll need to ensure that the armor you’re wearing provides Pacts that match the activation cost listed on the power. Let’s use the above Legendary Gloves as an example. They provide 1 Ferocity, 1 Divinity, and 1 Eternity Pacts. If you have a Vampiric Power that requires 1 Ferocity to activate, then this item alone covers the requirement, and you still have 1 Divinity and 1 Eternity available. If you equip a second Vampiric Power that requires both 1 Divinity and 1 Eternity to activate, the boots still provide enough Pacts to activate both powers. [h3]Customize Pact Armor to Your Needs[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/0399c811a08942c0e7c3a5fa3e381ab4b0553a3e.jpg[/img] You might not always have armor with the right Pacts to activate the Vampiric Powers in your collection. The Dark Master’s servants have devised two types of items to remedy this situation: standalone Pacts and Cleansing Acids. Standalone Pacts are used to add a specific type of Pact to an item of your choice (this can only be done if the maximum amount of that Pact type isn’t already on that item). Cleansing Acids are used to remove Pacts from an item. These crafting items can be pried from the clutches of Blood Seekers, as well as acquired from the Blood Harvest Season event, Season Journey, Opulent Coffins, and through the new Questline. Use these tools to ensure you always have Pact Armor that matches the Vampiric Powers you’d like to use. [h3]Bleed New Blood into Your Build[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/05d9d6f3118697f5d4e66ed2e9fe2e39e5a4f50b.jpg[/img] Now that you’ve learned of Vampiric Powers and Pact Armor, let’s look at the [b]22 Vampiric Powers available[/b] in Season of Blood. All Classes can wield any Vampiric Power, and in doing so, they will sculpt your character into a vampire-killing machine. Will you seek to diversify your collection of powers or concentrate your resources on maxing out a handful of them? The new Vampiric Curse keyword has been added to complement these terrifying powers. Look out for it as you read about each power. Vampiric Curse: Killing an enemy affected by your Vampiric Curse stores their soul. Casting a Defensive, Macabre, or Agility Skill will unleash stored souls to attack nearby enemies. You can hold up to 8 souls. The below values reflect each Vampiric Power at their maximum Level 3. [b]Minor Vampiric Powers (1–3 Pacts Required):[/b] [list] [*][b]Anticipation (1 Divinity):[/b] Your Ultimate Skills gain 20% Cooldown Reduction. Your Ultimate Skills gain 12% increased damage for each nearby enemy affected by your Damage Over Time effects.[/*] [*][b]Coven’s Fangs (2 Divinity):[/b] Your Conjuration, Companion, Minion, and Bat Familiar attacks deal 52% increased damage to Crowd Controlled enemies. Lucky Hit: Your Conjuration, Companion, Minion, and Bat Familiar have up to a 30% chance to inflict Vampiric Curse when hitting enemies.[/*] [*][b]Domination (1 Ferocity):[/b] You deal 24% increased damage to enemies who are Stunned, Immobilized, Frozen, or Feared. If they're also Injured and not an Elite, they're instantly killed.[/*] [*][b]Feed the Coven (1 Eternity):[/b] Lucky Hit: Conjuration, Companion, Minion and Bat Familiar attacks have up to a 60% chance to restore 10 Primary Resource to you and increase your Damage by 10% for 4 seconds.[/*] [*][b]Hectic (3 Divinity):[/b] For every 5 Basic Skills you cast, one of your active Cooldowns is reduced by 2 seconds.[/*] [*][b]Hemomancy (3 Eternity):[/b] Your attacks deal 80% of your Maximum Life as Physical damage to nearby enemies. This can only occur once every 4 seconds. You heal for 1% of your Maximum Life for each enemy damaged this way.[/*] [*][b]Infection (1 Ferocity):[/b] Hitting enemies with direct damage infects them with Pox. Inflicting Pox 8 times on an enemy expunges their infection, dealing 70% Poison damage.[/*] [*][b]Jagged Spikes (1 Ferocity, 1 Divinity):[/b] Thorns have a 10% chance to deal 300% increased damage and Chill enemies for 8%.[/*] [*][b]Prey on the Weak (2 Ferocity):[/b] You deal 16% increased damage to Vulnerable enemies. Enemies are Vulnerable while affected by a Vampiric Curse from your other Vampiric Powers.[/*] [*][b]Rampart (1 Divinity, 1 Eternity):[/b] After not moving for 3 seconds, you gain a Barrier for 40% of your Maximum Life for 6 seconds. This effect can occur once every 20 seconds.[/*] [*][b]Ravenous (3 Ferocity):[/b] Lucky Hit: Up to a 20% chance to increase your Attack Speed by 40% of your Total Movement Speed for 6 seconds.[/*] [*][b]Resilience (2 Eternity):[/b] You gain 1% Damage Reduction for each 2% Life you are missing.[/*] [*][b]Sanguine Brace (1 Divinity, 1 Eternity):[/b] When you kill an enemy, Fortify for 6% of your Base Life. While you have more Fortify than half of your Maximum Life, you gain 8% Critical Strike Chance.[/*] [*][b]Terror (1 Ferocity, 1 Divinity, 1 Eternity):[/b] When struck, you have a 14% chance to Fear nearby enemies and Slow them by 80% for 2 seconds. You are guaranteed to Critically Strike enemies who are Feared.[/*] [*][b]Undying (1 Eternity):[/b] Casting Skills heals you for 3% Life. Double this bonus while below 50% Life.[/*][/list] [b]Major Vampiric Powers (6 Pacts Required):[/b] [list] [*][b]Accursed Touch (6 Divinity):[/b] Lucky Hit: Up to a 44% chance to inflict Vampiric Curse on enemies. Enemies with the Vampiric Curse have a 15% chance to spread it to other surrounding enemies. Accursed Souls deal 200% increased damage.[/*] [*][b]Bathe in Blood (3 Divinity, 3 Eternity):[/b] While Channeling a Skill, you form a pool of blood beneath you. While channeling a skill in a pool, your Channeled Skills deal 40% increased damage and you gain 30% Damage Reduction. A pool can only form once every 8 seconds.[/*] [*][b]Blood Boil (6 Eternity):[/b] When your Core Skills Overpower an enemy, you spawn 3 Volatile Blood Drops. Collecting a Volatile Blood Drop causes it to explode, dealing 60% Physical damage around you. Every 20 seconds, your next Skill is guaranteed to Overpower.[/*] [*][b]Call Familiar (3 Ferocity, 3 Divinity):[/b] Casting a Mastery, Weapon Mastery, Macabre, Wrath, or Imbuement Skill calls a bat ally to attack nearby enemies, dealing 80% Physical damage with a 30% chance to Stun.[/*] [*][b]Flowing Veins (2 Ferocity, 2 Divinity, 2 Eternity):[/b] You deal 60% increased Damage Over Time to enemies that are moving or affected by a Vampiric Curse.[/*] [*][b]Metamorphosis (2 Ferocity, 2 Divinity, 2 Eternity):[/b] When you Evade you turn into a cloud of bats, becoming Unstoppable for 4 seconds. Enemies along your path take 160% Physical damage and are inflicted with Vampiric Curse.[/*] [*][b]Moonrise (6 Ferocity):[/b] Hitting an enemy with a Basic Skill grants you 4% Attack Speed for 10 seconds, stacking up to 5 times. Upon reaching maximum stacks, you enter a Vampiric Bloodrage, gaining 160% Basic Skill damage and 15% Movement Speed for 10 seconds.[/*][/list] [h2]Reap Hunter’s Acclaim from the Blood Harvest Season Event[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/4b84c0e5d7c951c4c2cbb2ccb9f84eef41682b7a.jpg[/img] Home to the highest chance for receiving Potent Blood and Pact Armor drops is the [b]Blood Harvest Seasonal Event[/b]. With a wave of his hand, the Dark Master has dispatched cunning Blood Seekers with armies of vampires to conquest the Dry Steppes, Hawezar, and Scosglen regions of Sanctuary, imprisoning its denizens and causing pandemonium. Putting enemies to the sword during Bounties, bursting Blood Blisters, completing World Events, disrupting vampiric rituals, and freeing prisoners, will earn you some [b]Reputation[/b]. With Reputation, you’ll climb Tiers containing useful rewards, such as crafting materials, Items, and Pact consumables. [img]{STEAM_CLAN_IMAGE}/44681402/202b03059b7e0efc065c222eb47d025c4f03a191.jpg[/img] Inside the Blood Harvest, you’ll have the chance to acquire Blood Lures, which summon Blood Seekers for you to extinguish. You can also use any Seeker Keys you find to free prisoners of the Dark Master's army or on Seekers Caches to receive Pact Armor, Pact Consumables, and Potent Blood. [h3]Crush the Dark Master’s Army in New Events[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/9e581b01d6db3c489305d23bbee51c64abb0d8bb.jpg[/img] There will also be new World Events and Dungeon Events where you can go toe-to-toe with more Blood Seekers and other vampire foot soldiers as well. The dark master’s army calls some of Sanctuary’s Dungeons home—delve into their depths to see what secrets lie in wait. [h2]Conquer Brutish Endgame Bosses[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/91eebe4a5f29c17da4429c4f1128280cdc73e598.jpg[/img] Reinforcements from the darkest depths of the Burning Hells take hold of Sanctuary, ushering in a new era of death and wanton destruction. This batch of Uber difficulty Endgame bosses are not for the faint of heart, but the chance to receive Unique items and Cosmetic items await those who muster the courage to stand against them. Each boss has a variety of Unique items they can drop, with some of those being exclusive to only that boss. The same goes for the special Cosmetic items they can potentially drop. You can test your hand at slaying these unsightly abominations in the Eternal or Seasonal Realms starting in World Tier III, with even more intense encounters awaiting you in World Tier IV. These foes will only grant you an audience on their terms. [b]Below is a list of the bosses and the requirements to encounter them.[/b] Grigoire, The Galvanic Saint (World Tier III and IV): You must gather enough Living Steel from the Tortured Offering in Helltide. In addition to Unique items that can only drop from Grigoire, you also have a chance to receive the Demonbinder Mount Armor Cosmetic. [img]{STEAM_CLAN_IMAGE}/44681402/42647178dc6fc0b8aeb984ef3aacf348957489e2.jpg[/img] Echo of Varshan (World Tier III and IV): Defeat Grotesque Debtors during Whispers of the Dead for a chance to receive parts of Varshan’s body. The Tree of Whispers collections—gained from turning in Grim Favors—guarantees a part of Varshan’s body. Once you have enough parts, including a Malignant Heart if you’re playing on World Tier IV, you can summon Varshan. The Flesh-Weld Rod Trophy has a chance to drop from this boss in addition to Unique items that can only drop from Varshan. [img]{STEAM_CLAN_IMAGE}/44681402/3591edf67b3a55892a2b2e9b9cad55d3a532262c.jpg[/img] The Beast in the Ice (World Tier IV): Gather Distilled Fear while completing Tier 30 or higher Nightmare Dungeons. After you have enough, visit the Occultist and craft the Glacial Fissure Nightmare Sigil, activate it, then you can fight The Beast in the Ice. The Skull Torch and Fell Steed Mount Trophies can potentially drop from this boss, in addition to Unique items exclusive to it. [img]{STEAM_CLAN_IMAGE}/44681402/dd1614ac85a6866c9655447e9d9ec19229fa209d.jpg[/img] Dark Master (World Tier IV): Defeat a World Boss on World Tier IV or complete a Legion Event. From these activities you’ll acquire Exquisite Blood. Once you have enough, you’ll be able to summon the Dark Master. The Diadem of the Ancient Helm Cosmetic can potentially drop from this boss, in addition to Unique items exclusive to it. [img]{STEAM_CLAN_IMAGE}/44681402/d5b04bcdb3d81e4eb49a104e59c6750e346de4a8.jpg[/img] Echo of Duriel (World Tier IV): Defeat both Grigoire, The Galvanic Saint and Varshan in World Tier IV to collect Mucus-Slick Eggs and Shards of Agony. Once you have enough, you’ll be able to summon the Lord of Pain, Duriel! Out of this group of Bosses, Duriel is the only one who has a chance to drop Uber Unique items. The smoldering Brimstone Mount can also potentially drop from this boss. [img]{STEAM_CLAN_IMAGE}/44681402/adc0f7d4e9bac35a97048a1fcd4fd557f59e7398.jpg[/img] Keep in mind that: You’ll need to meet the summoning conditions of a boss each time you want to fight it, so hold on to any additional summoning materials that you might acquire during your travels. [b]Developer’s Note: [/b][i]We have received feedback that there is a lack of variety in the Endgame experiences offered and that there are not enough opportunities to farm Unique and Uber Unique items. This group of Endgame bosses were created to pose a challenge to high-level players while allowing them to farm sought-after items in a fun and intense way.[/i] These demonic barons of torment await the opportunity to grind you into dust—defy their expectations! [h2]Earn Rewards with the Season Journey and Battle Pass[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/38d8b496e7394e97fdd325b9f6613022b3e9670d.jpg[/img] As you hunt down Lord Zir’s acolytes with Erys and unlock the secrets of your newfound Vampiric Powers, you’ll earn rewards from the [b]Season Journey[/b] and [b]Battle Pass[/b]. The Season Journey is broken into Chapters with tasks to complete. As you progress through the Journey, you’ll earn rewards befitting Sanctuary’s defenders, such as new Legendary Aspects, the Salmagundi mount, Strips and Points mount armor, and 3 [b]Scrolls of Amnesia[/b], which provide a free Skill Tree and Paragon Board reset. The Journey also provides Favor—the resource used to climb through the Battle Pass’ Tiers—which can also be earned naturally by playing aspects of the game. [h3]Douse Your Wanderer in Sanguine Styles[/h3] [img]{STEAM_CLAN_IMAGE}/44681402/4fef51daece3cb399c90ba2947e6d8637e34ca77.jpg[/img] The Season of Blood Battle Pass begins on [b]October 17, 10 a.m. PDT[/b] and hosts 90 Tiers—27 Free Tiers and 63 Premium Tiers. If you get the Premium Battle Pass, not only will the rewards of the Free Tiers be yours to wield, but Awoken Armor Sets, Mount and Mount Armor, Platinum, and more also await you. For example, the [b]Famished Thoroughbred mount unlocks at Tier 1 and Awoken Marrow cosmetics unlocks at various higher Tiers[/b]. If you decide to embrace the bloody madness and get the Accelerated Seasonal Battle Pass, you’ll also receive 20 Tier Skips and the Vampire’s Repose emote. Smoldering Ashes earned from the Free Tiers can be spent on Season Blessings that provide helpful bonuses to beat back Hell’s armies. There are five total Blessings to choose from, three of which are new with Season of Blood: [list] [*]Urn of Blood: Boost the Hunter’s Acclaim you earn from Blood Harvest activities.[/*] [*]Urn of Helltides: Boost the chance to receive an extra equipment item from Helltide chests. The extra item will be of Legendary rarity or better.[/*] [*]Urn of Swift Travel: Boost how quickly your Mount recovers from sprinting.[/*][/list] The bonuses gained from Season Blessings only last until the end of Season of Blood. [h2]Acquire Fabled Threads from Tejal’s Shop[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/d99e8543810bf46201afcb380bb2a7579e19c3bc.jpg[/img] We’re dialing up the heat in the Shop with new Equipment, Armor, Accessories, Mount and Mount Armor bundles that will have you slaying in style. Starting on October 17, you’ll want to pay Tejal a visit to browse her wares—remember to check back often as she’ll update her stock throughout Season of Blood. One such rarefied find from the far reaches of Sanctuary is the [b]Hell’s Champion Prestige Barbarian Equipment[/b], which contains an Armor Cosmetic, 2 Weapon Cosmetics, and a Marking for all your Barbarian characters. [h2]Seasons and Your Stashed Items[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/92fe8d633da6aa31da91aa244b89a156c3a5c383.jpg[/img] With Season of the Malignant coming to an end, we want to ensure your hard-earned gear transfers to the Eternal Realm with you. Once Season of the Malignant ends, all Seasonal characters will be transferred to the Eternal Realm. All items in that character’s Season of the Malignant Stash will go into a new Withdraw Only Stash tab in the Eternal Realm. You have all of Season of Blood to withdraw any items you would like to keep from Season of the Malignant—any items left in the Withdraw Only Stash tab once Season of Blood ends will be unrecoverable. [h2]Claim the Umber Winged Darkness Cosmetic Set[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/4791a1efceba152dc587c302cd6baeeb2e8bf8cd.jpg[/img] One of Hell’s gifts will be returning to the ether soon. If you purchased any digital edition of Diablo IV prior to October 17, you have [b]until March 31, 2024, to redeem your Umber Winged Darkness Cosmetic Set for Diablo Immortal[/b]. This cosmetic can be redeemed by logging into Diablo Immortal and clicking on the corresponding in-game mail notification. [h2]Storm into the Season with NVIDIA DLSS 3[/h2] [img]{STEAM_CLAN_IMAGE}/44681402/0c890c648a9ba16c2516c6f05e5a35b9745f4b70.jpg[/img] You might be ready to hunt the hunter in Season of Blood after reading our preview, but so must your PC. Experience the slaughter with enhanced performance using NVIDIA DLSS 3. For more information on DLSS 3, visit [url=https://www.nvidia.com/geforce/news/diablo-iv-dlss-3-reflex-rtx/]NVIDIA’s website[/url]. [h2]Stay Up to Date with Diablo IV News[/h2] We held a Developer Update Livestream today focused on the quality-of-life changes coming in Season of Blood, which can be watched [url=https://store.steampowered.com/news/app/2344520/view/3714964345745210362]here[/url]. Also, follow our official [url=https://x.com/Diablo]Diablo IV account on X[/url] for updates and the occasional dark meme. May you overcome the Burning Hell’s legions in Season of Blood! -The Diablo IV Team", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
{"source": "steam_news_api", "gid": "5220292521178104623", "title": "Descend into the Diablo IV Developer Update Livestream", "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5220292521178104623", "date_utc": "2023-10-04T20:24:37+00:00", "contents": "Fresh from a packed Developer Update Livestream, the team provided an overview of the Season of Blood and a trove of quality-of-life updates. For a quick top-level preview, we are adding more Endgame activities, significantly increasing Experience gains to reduce the journey to Level 100 and increasing the ability to specifically target Uniques and Uber Uniques. Associate director of community Adam Fletcher sat down with members of the development team to siphon the details of the upcoming Season of Blood with Patch 1.2.0, arriving on October 17th. With so much information to share about Season 2, we’re following up with a Campfire Chat to talk about Class balance, new Unique items, sweeping changes to Resistances, and a great deal of other quality-of-life updates and bug fixes. Visit [url=https://news.blizzard.com/diablo4/23964909/]this article[/url] on October 10 for more information. In the Season of Blood, Players will have to harness the power of the vampiric scourge to successfully defend themselves from its originators including the Blood Seekers that shadow your every move. If you’d like more details on our upcoming Season of Blood, visit [url=https://store.steampowered.com/news/app/2344520/view/3714964345745235807]this article[/url]. [img]{STEAM_CLAN_IMAGE}/44681402/434ffe36bfcecac4084508b8e660468ba1d892f9.png[/img] [i]The Echo of Duriel Boss fight will prove to be a formidable test of ferocity.[/i] During the Developer Update Livestream, the team dove into many community-requested features coming with Season of Blood. The following quality-of-life features arrive with Season of Blood: [h3]5 New Endgame Bosses[/h3][list] [*]Five Endgame bosses have been added across Sanctuary to increase the variety of Endgame experiences offered, providing better opportunities to obtain specific, Unique and Uber Unique items. [list] [*]The new Boss fights are unlocked based on succeeding in different tasks across Sanctuary, with different resources required for facing each Boss, and each new fight becoming available as you progress through World Tiers III and IV. [list] [*]Specific details to encounter each boss can be found in our [url=https://store.steampowered.com/news/app/2344520/view/3714964345745235807]Season of Blood article[/url].[/*] [/list] [/*] [/list] [/*] [*]The reward pools for these Endgame bosses have been significantly improved: [list] [*]Each boss drops specific Uniques, exclusive to each individual boss fight. [list] [*]The Duriel boss fight has significantly increased the chance to drop Uber Uniques, making the process of accessing these coveted items more achievable.[/*] [/list] [/*] [*]Each individual boss also has a chance to drop unique cosmetics specific to each boss, making the access of specific cosmetics in-game more targeted.[/*] [/list] [/*][/list][h3]Endgame Activities[/h3][list] [*]The time between Legion Events has been reduced from 30 to 25 minutes. [list] [*]Legion Event warning timers increased from 5 to 10 minutes.[/*] [*]Fixed an issue where the Legion Event pin would not display at the edge of a player’s mini-map if a Whisper was active for the Legion Event.[/*] [/list] [/*] [*]The World Boss fight is available more frequently to players on all World Tiers as the Spawn Times have been reduced from 6 hours to 3 hours and 30 minutes. [list] [*]World Boss warning timers have increased from 30 to 60 minutes.[/*] [*]Fixed an issue where the World Boss pin would not display at the edge of a player’s mini-map if a Whisper was active for the World Boss.[/*] [*]For increased visibility, a message is now broadcast to all players when the World Boss is 15 minutes away from spawning.[/*] [/list] [/*] [*]Gold and Experience rewards have been increased from the following activities: [list] [*]Helltide Chests[/*] [*]Cashing in Grim Favors[/*] [*]Completing individual Whispers[/*] [/list] [/*] [*]To ensure enemies constantly give experience relative to the current player level, the Nightmare Sigils rewarded from Whisper Caches will now always be within 5 Levels of the highest-level Nightmare Dungeon the player has completed.[/*] [*]To improve readability, Helltide Chests now have specific icons on the map to indicate their type.[/*] [*]Whisper Caches adhere to the item slot of the cache.[/*][/list][h3]Experience and Monster Levelling[/h3][list] [*]Decreased the time spent to reach level 100, making the journey about 40% faster. The experience gained from killing monsters at level 50+ has been significantly increased and rises steadily as you level.[/*] [*]Prevent Monsters from being less powerful as character level increases by making Monsters in World Tier III and IV match the current player level at a minimum after Levels 55 and 75 respectively. This increases the overall experience of levelling, making it much smoother.[/*] [*]Incenses now grant a bonus to Experience and persist after death.[/*] [*]Increased the potency of Experience bonuses (Elixir, Season Blessings) by making them multiplicative with the World Tier bonus.[/*][/list][h3]Nightmare Dungeons[/h3][list] [*]Expedited the demon slaying process as Nightmare Sigils now teleports you directly into the Nightmare Dungeon.[/*] [*]Avoided some players not getting Nightmare Sigils from Dungeons that have no final boss, Nightmare Sigils are now rewarded upon completing a Nightmare Dungeon instead of final boss defeat.[/*] [*]Objectives have been removed from some Dungeons, only defeating the boss is needed to defeat the Nightmare Dungeon.[/*] [*]Multiple Nightmare Dungeon Afflictions have been updated. [list] [*]Backstabbers [list] [*]Close Monster attacks from behind cause you to become Vulnerable. Vulnerable damage taken is increased by X%.[/*] [/list] [/*] [*]Monster Critical Resist [list] [*]Monster attacks reduce the damage of your Critical Strikes by 3 seconds by X%, stacking up to Y%.[/*] [/list] [/*] [*]Death Pulse [list] [*]Prevent death pulses on monsters that have explosions on death.[/*] [*]Prevent death pulses from spawning repeatedly on top of each other.[/*] [/list] [/*] [*]Lightning Storm [list] [*]Being ‘shocked’ while in the protection dome grants 35% bonus Movement Speed for 5 seconds.[/*] [*]Only starts when players are in combat.[/*] [*]Only starts if the protection dome caster has a direct path to its targeted player.[/*] [/list] [/*] [*]Drifting Shade [list] [*]Duration reduced from 5 seconds to 3 seconds.[/*] [*]Respawn time increased by 2 seconds.[/*] [/list] [/*] [/list] [/*] [*]Massively reduced backtracking by placing all Dungeon objectives on the critical path of a dungeon, making them much harder to miss by taking a wrong turn.[/*] [*]Many dungeon layouts have been redesigned.[/*] [*]Improved the overall readability of Traps by enhancing their overall visual effects and reducing their crowd control.[/*] [*]Endcaps have been added to ensure Dungeon layouts don’t feel too linear.[/*] [*]Paragon Glyph experience has been increased.[/*][/list][h3]Events[/h3][list] [*]Made Dungeon Events more worthwhile and enticing to players by increasing their monster density.[/*] [*]NPC’s should no longer be killed with one-hit in World Tiers III and IV.[/*][/list][h3]Item Adjustments[/h3][list] [*]Significantly freed up inventory space by making Gems a crafting material. Gem materials can now be taken to a Jeweler for crafting.[/*] [*]Prevented players from losing their progress on a Hardcore character from connectivity issues, Scrolls of Escape are now consumed if a Hardcore player disconnects while in combat, teleporting them to a safe location.[/*] [*]Reduced the chance of being locked into certain stats on a Legendary item by reducing their overall enchanting costs.[/*] [*]Reduced overburdening inventories and causing unnecessary trips into town: [list] [*]In World Tier III: Normal, Magic, and non-sacred Rare items will drop as crafting resources.[/*] [*]In World Tier IV: Normal, Magic, and non-ancestral Rare items will drop as crafting resources. [list] [*]Gold drop rates in World Tiers III and IV have been increased to compensate for this.[/*] [/list] [/*] [/list] [/*] [*]Higher level monsters in World Tiers III and IV drop Sacred and Ancestral items of greater Item Power potential.[/*] [*]Normal Whisper cache rewards now provide +10 Item Power. Upgraded caches now provide +20 Item Power rewards.[/*] [*]Helltide cache rewards now provide rewards of +20 Item Power value.[/*][/list][h3]Misc. Improvements[/h3][list] [*]Reduced the time spent having to regain renown each season, all earned renown rewards persist between seasons and characters (this does not include experience or Gold). [list] [*]Earned Skill Points, Potion Capacity, Max Obols and Paragon Points earned from Renown will persist between each character. Renown Experience and Gold must be earned on each character. [list] [*]For example: [list] [*]Character 1: earns Renown Tier II in a region [list] [*]Gains 1 Skill Point, 1 Potion Capacity[/*] [/list] [/*] [*]Creates Character 2, earns Renown Tier I in a different region [list] [*]Gains 1 Skill Points[/*] [/list] [/*] [*]Creates Character 3: [list] [*]This Character automatically receives both renown rewards from Characters 1 and 2 [list] [*]2 Skill Points, 1 Potion Capacity available[/*] [/list] [/*] [/list] [/*] [/list] [/*] [/list] [/*] [*]This also applies to Hardcore characters. If renown rewards were earned on a Hardcore character in Season of the Malignant, those earned rewards persist for a new Hardcore character in Season of Blood regardless of whether your previous Hardcore character died. [list] [*]For Hardcore characters, Altars of Lilith and Map Discovery progress still carries over within the Hardcore realm. Similar to Season of the Malignant, Altars of Lilith and Map Discovery progress for Hardcore characters that died before Season of the Malignant will not persist for Season of Blood.[/*] [/list] [/*] [/list] [/*] [*]Coveted Items can now be marked as Favorite, and cannot not be sold or salvaged.[/*] [*]2 additional character slots have been added.[/*] [*]Eased the ability for players that haven’t completed the campaign to access Seasonal content earlier, by adding the option to skip the Campaign on character creation if any character on your account has completed the Prologue.[/*] [*]Prevented wasted Minion and Companion attacks by ensuring Minions and Companions no longer target invulnerable enemies.[/*][/list][h3]Mounts[/h3][list] [*]Improved the horse-riding experience by improving the overall responsiveness of mounts. They are less likely to get stuck on barriers or slow down unexpectedly.[/*] [*]Reduced the time it takes to travel across Sanctuary by increasing spur duration, which now breaks barricades.[/*] [*]Base speed increased by 15% (this does not affect top speed.)[/*] [*]Removed the need for Players to place their cursor on the edge of their window for max speed, general speed has been improved relative to cursor placement.[/*] [*]Improved combat and mount versatility by reducing ability cooldowns by 50%. [list] [*]Manual dismount cooldown has been reduced from 10 to 5 seconds.[/*] [*]Forced dismount from damage cooldown has been reduced from 10 to 4 seconds.[/*] [*]The delay between a dismount combat skill becoming available after mounting (ex: the Barbarian’s Bounding Slam) has been reduced from 10 to 3 seconds.[/*] [/list] [/*][/list] [img]{STEAM_CLAN_IMAGE}/44681402/b4f524c729a90b4a41387848a8d07fb7eff474a8.jpg[/img] [i]Stashes are now available in all small towns with Waypoints.[/i] [h3]Town Adjustments[/h3][list] [*]Additional Stashes have been added to all Capital Cities near important vendors.[/*] [*]Reduced the need to travel to Capital Cities by adding Stashes to all small towns with Waypoints.[/*] [*]Reduced the need to travel to Capital Cities by adding an Occultist to the Tree of Whispers Waypoint.[/*] [*]Reduced the need for additional walking, Purveryors of Curiosities have set up shop closer to the Waypoint in several Capital Cities: [list] [*]Kyovashad[/*] [*]Zabinzet[/*] [*]Ked Bardu[/*] [*]Gea-Kul[/*] [/list] [/*] [*]Improved Navigation through Sanctuary following character creation by adding 10 Waypoints to the list of automatically unlocked Waypoints for those that skip the Campaign. [list] [*]There are 2 Waypoints in each Region.[/*] [*]Note that for players that choose to skip the Campaign and haven’t unlocked these 10 Waypoints on any character, they will not be automatically available.[/*] [/list] [/*][/list] [img]{STEAM_CLAN_IMAGE}/44681402/c0045ca8219e8f68c3a32384fd5146c233eac686.jpg[/img] [i]Stash search and Stash filter functionality has been added.[/i] [h3]UI & UX[/h3][list] [*]Improved item sorting and overall organization by adding Stash search and Stash filter functionality.[/*] [*]Improved Streaming functionality by adding Streamer Mode, which hides sensitive information such as Character names or Battle.net usernames.[/*] [*]Improved organization by displaying Item affix tooltips in a more intuitive and consistent order.[/*] [*]Improved organization by grouping Extracted Aspects with the same Legendary powers together when sorting in your Stash and Inventory.[/*] [*]Improved navigation functionality by adding the ability to auto-run. When moving in a direction, the player will continuously move in the direction faced or where the cursor is placed until another movement is activated or a skill is initiated.[/*] [*]Improved navigation by adjusting the zoom level of the Mini-map.[/*] [*]Added an option for hiding all Combat text (ie. Vulnerable, Dodge, Fortified)[/*] [*]Improved Unique item visibility.[/*] [*]Improved access to the Screen Reader option by enabling it by default.[/*] [*]Improved cursor contrast colors and options for versatility and customization.[/*][/list] This is only a top-level list of the improvements included with Season of Blood—to take a more in-depth look watch the recap of our Developer Update Livestream below. [previewyoutube=a8tBnev3n8Q;full][/previewyoutube] The team also discussed the Season of Blood Battle Pass and shed light on the improved rewards from the Free Tiers. Don’t miss our next [b]Campfire Chat on October 10[/b] that will cover class balance changes, updates to damage resistances, changes to Unique item acquisition, and more. If you’d like to read our article that provides a look at the upcoming Season of Blood, see [url=https://store.steampowered.com/news/app/2344520/view/3714964345745235807]this Article[/url].", "feedname": "steam_community_announcements", "feedlabel": "Community Announcements"}
